[Killed] BlockStatement
graphql/mutations/assignTaskMutation.js:11:51
   args: {
     input: { type: new GraphQLNonNull(AssignTaskInput) },
   },
-  resolve: async (_source, { input }, context) => {
-    const task = await db.Task.findByPk(input.taskID);
-    if (!task) throw new Error('Task not found');
-
-    if (!input.assigneeUsername) throw new Error('Assignee username is required');
-
-    const assignee = await db.User.findOne({ where: { username: input.assigneeUsername } });
-    if (!assignee) throw new Error('Assignee not found');
-
-    await task.update({ assigneeUserID: assignee.userID });
-
-    const includes = [
-    { model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] },
-    { model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] },
-    { model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] },
-    { model: db.Project, as: 'project', attributes: ['projectID', 'name'] },
-    ];
-
-    return await db.Task.findByPk(task.taskID, { include: includes });
-  },
+  resolve: async (_source, { input }, context) => {},
 };
 
killedBy: tasks_assignTaskMutation assignTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'assignee')

[Killed] ConditionalExpression
graphql/mutations/assignTaskMutation.js:13:9
   },
   resolve: async (_source, { input }, context) => {
     const task = await db.Task.findByPk(input.taskID);
-    if (!task) throw new Error('Task not found');
+    if (false) throw new Error('Task not found');
 
     if (!input.assigneeUsername) throw new Error('Assignee username is required');
killedBy: tasks_assignTaskMutation assignTaskTaskNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Task not found"
Received: "Cannot read properties of null (reading 'update')"

[Killed] ConditionalExpression
graphql/mutations/assignTaskMutation.js:13:9
   },
   resolve: async (_source, { input }, context) => {
     const task = await db.Task.findByPk(input.taskID);
-    if (!task) throw new Error('Task not found');
+    if (true) throw new Error('Task not found');
 
     if (!input.assigneeUsername) throw new Error('Assignee username is required');
killedBy: tasks_assignTaskMutation assignTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Task not found]]

[Killed] BooleanLiteral
graphql/mutations/assignTaskMutation.js:15:9
     const task = await db.Task.findByPk(input.taskID);
     if (!task) throw new Error('Task not found');
 
-    if (!input.assigneeUsername) throw new Error('Assignee username is required');
+    if (input.assigneeUsername) throw new Error('Assignee username is required');
 
     const assignee = await db.User.findOne({ where: { username: input.assigneeUsername } });
killedBy: tasks_assignTaskMutation assignTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Assignee username is required]]

[Killed] ConditionalExpression
graphql/mutations/assignTaskMutation.js:15:9
     const task = await db.Task.findByPk(input.taskID);
     if (!task) throw new Error('Task not found');
 
-    if (!input.assigneeUsername) throw new Error('Assignee username is required');
+    if (false) throw new Error('Assignee username is required');
 
     const assignee = await db.User.findOne({ where: { username: input.assigneeUsername } });
killedBy: tasks_assignTaskMutation assignTaskMissingAssigneeUsername
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Assignee username is required"
Received: "WHERE parameter \"username\" has invalid \"undefined\" value"

[Killed] ObjectLiteral
graphql/mutations/assignTaskMutation.js:17:53
 
     if (!input.assigneeUsername) throw new Error('Assignee username is required');
 
-    const assignee = await db.User.findOne({ where: { username: input.assigneeUsername } });
+    const assignee = await db.User.findOne({ where: {} });
     if (!assignee) throw new Error('Assignee not found');
 
killedBy: tasks_assignTaskMutation assignTaskAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BooleanLiteral
graphql/mutations/assignTaskMutation.js:18:9
     if (!input.assigneeUsername) throw new Error('Assignee username is required');
 
     const assignee = await db.User.findOne({ where: { username: input.assigneeUsername } });
-    if (!assignee) throw new Error('Assignee not found');
+    if (assignee) throw new Error('Assignee not found');
 
     await task.update({ assigneeUserID: assignee.userID });
killedBy: tasks_assignTaskMutation assignTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Assignee not found]]

[Killed] ConditionalExpression
graphql/mutations/assignTaskMutation.js:18:9
     if (!input.assigneeUsername) throw new Error('Assignee username is required');
 
     const assignee = await db.User.findOne({ where: { username: input.assigneeUsername } });
-    if (!assignee) throw new Error('Assignee not found');
+    if (false) throw new Error('Assignee not found');
 
     await task.update({ assigneeUserID: assignee.userID });
killedBy: tasks_assignTaskMutation assignTaskAssigneeNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Assignee not found"
Received: "Cannot read properties of null (reading 'userID')"

[Killed] StringLiteral
graphql/mutations/assignTaskMutation.js:24:27
 
     const includes = [
     { model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] },
-    { model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] },
+    { model: db.User, as: "", attributes: ['userID', 'username', 'email'] },
     { model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] },
     { model: db.Project, as: 'project', attributes: ['projectID', 'name'] },
killedBy: tasks_assignTaskMutation assignTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: User is associated to Task multiple times. To identify the correct association, you must use the 'as' keyword to specify the alias of the association you want to include.]]

[Killed] StringLiteral
graphql/mutations/assignTaskMutation.js:24:62
 
     const includes = [
     { model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] },
-    { model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] },
+    { model: db.User, as: 'assignee', attributes: ['userID', "", 'email'] },
     { model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] },
     { model: db.Project, as: 'project', attributes: ['projectID', 'name'] },
killedBy: tasks_assignTaskMutation assignTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: SQLITE_ERROR: no such column: assignee.]]

[Killed] StringLiteral
graphql/mutations/assignTaskMutation.js:25:52
     const includes = [
     { model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] },
     { model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] },
-    { model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] },
+    { model: db.Sprint, as: 'sprint', attributes: ["", 'number'] },
     { model: db.Project, as: 'project', attributes: ['projectID', 'name'] },
     ];
killedBy: tasks_assignTaskMutation assignTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: SQLITE_ERROR: no such column: sprint.]]

[Killed] StringLiteral
graphql/mutations/assignTaskMutation.js:26:67
     { model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] },
     { model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] },
     { model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] },
-    { model: db.Project, as: 'project', attributes: ['projectID', 'name'] },
+    { model: db.Project, as: 'project', attributes: ['projectID', ""] },
     ];
 
killedBy: tasks_assignTaskMutation assignTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: SQLITE_ERROR: no such column: project.]]

[Killed] ObjectLiteral
graphql/mutations/assignTaskMutation.js:29:48
     { model: db.Project, as: 'project', attributes: ['projectID', 'name'] },
     ];
 
-    return await db.Task.findByPk(task.taskID, { include: includes });
+    return await db.Task.findByPk(task.taskID, {});
   },
 };
killedBy: tasks_assignTaskMutation assignTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'userID')
