[Killed] BooleanLiteral
graphql/mutations/changeTaskStatusMutation.js:13:9
   },
   resolve: async (_source, { input }, context) => {
     const task = await db.Task.findByPk(input.taskID);
-    if (!task) throw new Error('Task not found');
+    if (task) throw new Error('Task not found');
 
     const hasStatusProp = Object.prototype.hasOwnProperty.call(input, 'status');
killedBy: tasks_changeTaskStatusMutation statusTransitionValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Task not found]]

[Killed] BooleanLiteral
graphql/mutations/changeTaskStatusMutation.js:16:9
     if (!task) throw new Error('Task not found');
 
     const hasStatusProp = Object.prototype.hasOwnProperty.call(input, 'status');
-    if (!hasStatusProp) {
+    if (hasStatusProp) {
       throw new Error('Status is required');
     }
killedBy: tasks_changeTaskStatusMutation statusTransitionValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Status is required]]

[Killed] BlockStatement
graphql/mutations/changeTaskStatusMutation.js:16:25
     if (!task) throw new Error('Task not found');
 
     const hasStatusProp = Object.prototype.hasOwnProperty.call(input, 'status');
-    if (!hasStatusProp) {
-      throw new Error('Status is required');
-    }
+    if (!hasStatusProp) {}
     if (input.status === null) {
       throw new Error('Status is required');
killedBy: tasks_changeTaskStatusMutation statusTransitionMissingStatus
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Status is required"
Received: "Invalid status"

[Killed] StringLiteral
graphql/mutations/changeTaskStatusMutation.js:17:23
 
     const hasStatusProp = Object.prototype.hasOwnProperty.call(input, 'status');
     if (!hasStatusProp) {
-      throw new Error('Status is required');
+      throw new Error("");
     }
     if (input.status === null) {
killedBy: tasks_changeTaskStatusMutation statusTransitionMissingStatus
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Status is required"
Received: ""

[Killed] ConditionalExpression
graphql/mutations/changeTaskStatusMutation.js:19:9
     if (!hasStatusProp) {
       throw new Error('Status is required');
     }
-    if (input.status === null) {
+    if (false) {
       throw new Error('Status is required');
     }
killedBy: tasks_changeTaskStatusMutation statusTransitionNullStatus
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Status is required"
Received: "Invalid status"

[Killed] ConditionalExpression
graphql/mutations/changeTaskStatusMutation.js:19:9
     if (!hasStatusProp) {
       throw new Error('Status is required');
     }
-    if (input.status === null) {
+    if (true) {
       throw new Error('Status is required');
     }
killedBy: tasks_changeTaskStatusMutation statusTransitionValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Status is required]]

[Killed] StringLiteral
graphql/mutations/changeTaskStatusMutation.js:23:30
       throw new Error('Status is required');
     }
 
-    const allowedStatuses = ['Open', 'In Progress', 'Done', 'Closed'];
+    const allowedStatuses = ["", 'In Progress', 'Done', 'Closed'];
     if (!allowedStatuses.includes(input.status)) throw new Error('Invalid status');
 
killedBy: tasks_changeTaskStatusMutation statusTransitionValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Invalid status]]

[Killed] BooleanLiteral
graphql/mutations/changeTaskStatusMutation.js:24:9
     }
 
     const allowedStatuses = ['Open', 'In Progress', 'Done', 'Closed'];
-    if (!allowedStatuses.includes(input.status)) throw new Error('Invalid status');
+    if (allowedStatuses.includes(input.status)) throw new Error('Invalid status');
 
     await task.update({ status: input.status });
killedBy: tasks_changeTaskStatusMutation statusTransitionValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Invalid status]]

[Killed] ConditionalExpression
graphql/mutations/changeTaskStatusMutation.js:24:9
     }
 
     const allowedStatuses = ['Open', 'In Progress', 'Done', 'Closed'];
-    if (!allowedStatuses.includes(input.status)) throw new Error('Invalid status');
+    if (true) throw new Error('Invalid status');
 
     await task.update({ status: input.status });
killedBy: tasks_changeTaskStatusMutation statusTransitionValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Invalid status]]

[Killed] ArrayDeclaration
graphql/mutations/changeTaskStatusMutation.js:28:22
 
     await task.update({ status: input.status });
 
-    const includes = [
-        { model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] },
-        { model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] },
-        { model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] },
-        { model: db.Project, as: 'project', attributes: ['projectID', 'name'] },
-    ];
+    const includes = [];
 
     return await db.Task.findByPk(task.taskID, { include: includes });
killedBy: tasks_changeTaskStatusMutation statusTransitionValid
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ObjectLiteral
graphql/mutations/changeTaskStatusMutation.js:29:9
     await task.update({ status: input.status });
 
     const includes = [
-        { model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] },
+        {},
         { model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] },
         { model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] },
killedBy: tasks_changeTaskStatusMutation statusTransitionValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Include unexpected. Element has to be either a Model, an Association or an object.]]

[Killed] StringLiteral
graphql/mutations/changeTaskStatusMutation.js:29:56
     await task.update({ status: input.status });
 
     const includes = [
-        { model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] },
+        { model: db.User, as: 'reporter', attributes: ["", 'username', 'email'] },
         { model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] },
         { model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] },
killedBy: tasks_changeTaskStatusMutation statusTransitionValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: SQLITE_ERROR: no such column: reporter.]]

[Killed] StringLiteral
graphql/mutations/changeTaskStatusMutation.js:30:56
 
     const includes = [
         { model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] },
-        { model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] },
+        { model: db.User, as: 'assignee', attributes: ["", 'username', 'email'] },
         { model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] },
         { model: db.Project, as: 'project', attributes: ['projectID', 'name'] },
killedBy: tasks_changeTaskStatusMutation statusTransitionValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: SQLITE_ERROR: no such column: assignee.]]

[Killed] ArrayDeclaration
graphql/mutations/changeTaskStatusMutation.js:31:55
     const includes = [
         { model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] },
         { model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] },
-        { model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] },
+        { model: db.Sprint, as: 'sprint', attributes: [] },
         { model: db.Project, as: 'project', attributes: ['projectID', 'name'] },
     ];
killedBy: tasks_changeTaskStatusMutation statusTransitionValid
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "sprintID",
-   "number",

[Killed] ObjectLiteral
graphql/mutations/changeTaskStatusMutation.js:32:9
         { model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] },
         { model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] },
         { model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] },
-        { model: db.Project, as: 'project', attributes: ['projectID', 'name'] },
+        {},
     ];
 
killedBy: tasks_changeTaskStatusMutation statusTransitionValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Include unexpected. Element has to be either a Model, an Association or an object.]]
