[Killed] BooleanLiteral
graphql/mutations/createSprintMutation.js:20:9
 
     authorizeRoles(context, ['Admin', 'Manager']);
 
-    if (!Object.prototype.hasOwnProperty.call(input, SPRINT_NUMBER)) {
+    if (Object.prototype.hasOwnProperty.call(input, SPRINT_NUMBER)) {
       throw new Error('Sprint number is required');
     }
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint number is required]]

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:20:9
 
     authorizeRoles(context, ['Admin', 'Manager']);
 
-    if (!Object.prototype.hasOwnProperty.call(input, SPRINT_NUMBER)) {
+    if (true) {
       throw new Error('Sprint number is required');
     }
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint number is required]]

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:26:9
     const sprintNumber = Number(input[SPRINT_NUMBER]);
 
     let description = null;
-    if (typeof input.description === 'string') {
+    if (true) {
       const trimmed = input.description.trim();
       if (trimmed.length > 2000) throw new Error('Sprint description must be at most 2000 characters');
killedBy: sprints_createSprintMutation createSprintWithoutDescription
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Cannot read properties of undefined (reading 'trim')]]

[Killed] BlockStatement
graphql/mutations/createSprintMutation.js:26:48
     const sprintNumber = Number(input[SPRINT_NUMBER]);
 
     let description = null;
-    if (typeof input.description === 'string') {
-      const trimmed = input.description.trim();
-      if (trimmed.length > 2000) throw new Error('Sprint description must be at most 2000 characters');
-      description = trimmed;
-    }
+    if (typeof input.description === 'string') {}
     const startDate = input.startDate;
     const endDate = input.endDate;
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Sprint description"
Received: null

[Killed] MethodExpression
graphql/mutations/createSprintMutation.js:27:23
 
     let description = null;
     if (typeof input.description === 'string') {
-      const trimmed = input.description.trim();
+      const trimmed = input.description;
       if (trimmed.length > 2000) throw new Error('Sprint description must be at most 2000 characters');
       description = trimmed;
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Sprint description"
Received: "   Sprint description   "

[Killed] EqualityOperator
graphql/mutations/createSprintMutation.js:28:11
     let description = null;
     if (typeof input.description === 'string') {
       const trimmed = input.description.trim();
-      if (trimmed.length > 2000) throw new Error('Sprint description must be at most 2000 characters');
+      if (trimmed.length <= 2000) throw new Error('Sprint description must be at most 2000 characters');
       description = trimmed;
     }
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint description must be at most 2000 characters]]

[Killed] EqualityOperator
graphql/mutations/createSprintMutation.js:28:11
     let description = null;
     if (typeof input.description === 'string') {
       const trimmed = input.description.trim();
-      if (trimmed.length > 2000) throw new Error('Sprint description must be at most 2000 characters');
+      if (trimmed.length >= 2000) throw new Error('Sprint description must be at most 2000 characters');
       description = trimmed;
     }
killedBy: sprints_createSprintMutation createSprintDescriptionAtBoundary
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint description must be at most 2000 characters]]

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:33:23
     }
     const startDate = input.startDate;
     const endDate = input.endDate;
-    const projectID = input.projectID || null;
+    const projectID = false;
 
     if (!Number.isInteger(sprintNumber)) {
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: SQLITE_CONSTRAINT: FOREIGN KEY constraint failed]]

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:33:23
     }
     const startDate = input.startDate;
     const endDate = input.endDate;
-    const projectID = input.projectID || null;
+    const projectID = true;
 
     if (!Number.isInteger(sprintNumber)) {
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Argument passed to findByPk is invalid: true]]

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:35:9
     const endDate = input.endDate;
     const projectID = input.projectID || null;
 
-    if (!Number.isInteger(sprintNumber)) {
+    if (false) {
       throw new Error('Sprint number must be an integer');
     }
killedBy: sprints_createSprintMutation createSprintNonIntegerNumber
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"description": "Sprint description", "endDate": "2026-01-14", "number": 1.5, "project": {"description": "Short description", "name": "CreateSprintProj3", "projectID": 1, "repositoryID": null}, "projectID": 1, "sprintID": 1, "startDate": "2026-01-01"}

[Killed] BooleanLiteral
graphql/mutations/createSprintMutation.js:35:9
     const endDate = input.endDate;
     const projectID = input.projectID || null;
 
-    if (!Number.isInteger(sprintNumber)) {
+    if (Number.isInteger(sprintNumber)) {
       throw new Error('Sprint number must be an integer');
     }
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint number must be an integer]]

[Killed] StringLiteral
graphql/mutations/createSprintMutation.js:36:23
     const projectID = input.projectID || null;
 
     if (!Number.isInteger(sprintNumber)) {
-      throw new Error('Sprint number must be an integer');
+      throw new Error("");
     }
     if (sprintNumber < 1) {
killedBy: sprints_createSprintMutation createSprintNonIntegerNumber
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Sprint number must be an integer"
Received message:   ""

      101 |         } else {
      102 |           stryCov_9fa48("255");
    > 103 |           throw new Error(stryMutAct_9fa48("256") ? "" : (stryCov_9fa48("256"), 'Sprint number must be an integer'));

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:38:9
     if (!Number.isInteger(sprintNumber)) {
       throw new Error('Sprint number must be an integer');
     }
-    if (sprintNumber < 1) {
+    if (true) {
       throw new Error('Sprint number must be greater than or equal to 1');
     }
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint number must be greater than or equal to 1]]

[Killed] EqualityOperator
graphql/mutations/createSprintMutation.js:38:9
     if (!Number.isInteger(sprintNumber)) {
       throw new Error('Sprint number must be an integer');
     }
-    if (sprintNumber < 1) {
+    if (sprintNumber <= 1) {
       throw new Error('Sprint number must be greater than or equal to 1');
     }
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint number must be greater than or equal to 1]]

[Killed] StringLiteral
graphql/mutations/createSprintMutation.js:39:23
       throw new Error('Sprint number must be an integer');
     }
     if (sprintNumber < 1) {
-      throw new Error('Sprint number must be greater than or equal to 1');
+      throw new Error("");
     }
 
killedBy: sprints_createSprintMutation createSprintNumberZeroInvalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Sprint number must be greater than or equal to 1"
Received: ""

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:42:9
       throw new Error('Sprint number must be greater than or equal to 1');
     }
 
-    if (!startDate) throw new Error('Start date is required');
+    if (false) throw new Error('Start date is required');
     if (!endDate) throw new Error('End date is required');
 
killedBy: sprints_createSprintMutation createSprintStartDateMissing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Start date is required"
Received: "Invalid date format"

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:42:9
       throw new Error('Sprint number must be greater than or equal to 1');
     }
 
-    if (!startDate) throw new Error('Start date is required');
+    if (true) throw new Error('Start date is required');
     if (!endDate) throw new Error('End date is required');
 
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Start date is required]]

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:43:9
     }
 
     if (!startDate) throw new Error('Start date is required');
-    if (!endDate) throw new Error('End date is required');
+    if (false) throw new Error('End date is required');
 
     const sDate = new Date(startDate);
killedBy: sprints_createSprintMutation createSprintEndDateMissing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "End date is required"
Received: "Invalid date format"

[Killed] BooleanLiteral
graphql/mutations/createSprintMutation.js:43:9
     }
 
     if (!startDate) throw new Error('Start date is required');
-    if (!endDate) throw new Error('End date is required');
+    if (endDate) throw new Error('End date is required');
 
     const sDate = new Date(startDate);
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: End date is required]]

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:47:9
 
     const sDate = new Date(startDate);
     const eDate = new Date(endDate);
-    if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {
+    if (true) {
       throw new Error('Invalid date format');
     }
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Invalid date format]]

[Killed] BlockStatement
graphql/mutations/createSprintMutation.js:47:59
 
     const sDate = new Date(startDate);
     const eDate = new Date(endDate);
-    if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {
-      throw new Error('Invalid date format');
-    }
+    if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {}
     if (sDate >= eDate) {
       throw new Error('Start date must be before end date');
killedBy: sprints_createSprintMutation createSprintInvalidDateFormat
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
graphql/mutations/createSprintMutation.js:48:23
     const sDate = new Date(startDate);
     const eDate = new Date(endDate);
     if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {
-      throw new Error('Invalid date format');
+      throw new Error("");
     }
     if (sDate >= eDate) {
killedBy: sprints_createSprintMutation createSprintInvalidDateFormat
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid date format"
Received: ""

[Killed] BlockStatement
graphql/mutations/createSprintMutation.js:50:25
     if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {
       throw new Error('Invalid date format');
     }
-    if (sDate >= eDate) {
-      throw new Error('Start date must be before end date');
-    }
+    if (sDate >= eDate) {}
 
     if (projectID) {
killedBy: sprints_createSprintMutation createSprintInvalidDates
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
graphql/mutations/createSprintMutation.js:50:9
     if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {
       throw new Error('Invalid date format');
     }
-    if (sDate >= eDate) {
+    if (sDate < eDate) {
       throw new Error('Start date must be before end date');
     }
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Start date must be before end date]]

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:54:9
       throw new Error('Start date must be before end date');
     }
 
-    if (projectID) {
+    if (true) {
       const project = await db.Project.findByPk(projectID);
       if (!project) throw new Error('Project not found');
killedBy: sprints_createSprintMutation createSprintWithoutProject
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project not found]]

[Killed] BlockStatement
graphql/mutations/createSprintMutation.js:54:20
       throw new Error('Start date must be before end date');
     }
 
-    if (projectID) {
-      const project = await db.Project.findByPk(projectID);
-      if (!project) throw new Error('Project not found');
-
-      const existingNumber = await db.Sprint.findOne({ where: { projectID, number: sprintNumber } });
-      if (existingNumber) {
-        throw new Error('Sprint number already exists in project');
-      }
-
-      const overlapping = await db.Sprint.findOne({
-        where: {
-          projectID,
-          [Op.or]: [
-            {
-              startDate: { [Op.lte]: endDate },
-              endDate: { [Op.gte]: startDate },
-            },
-          ],
-        },
-      });
-
-      if (overlapping) {
-        throw new Error('Sprint dates overlap with an existing sprint in this project');
-      }
-    }
+    if (projectID) {}
 
     const sprint = await db.Sprint.create({
killedBy: sprints_createSprintMutation createSprintDuplicateNumberInProject
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ObjectLiteral
graphql/mutations/createSprintMutation.js:58:63
       const project = await db.Project.findByPk(projectID);
       if (!project) throw new Error('Project not found');
 
-      const existingNumber = await db.Sprint.findOne({ where: { projectID, number: sprintNumber } });
+      const existingNumber = await db.Sprint.findOne({ where: {} });
       if (existingNumber) {
         throw new Error('Sprint number already exists in project');
killedBy: sprints_createSprintMutation createSprintDatesOverlap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Sprint dates overlap with an existing sprint in this project"
Received: "Sprint number already exists in project"

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:59:11
       if (!project) throw new Error('Project not found');
 
       const existingNumber = await db.Sprint.findOne({ where: { projectID, number: sprintNumber } });
-      if (existingNumber) {
+      if (false) {
         throw new Error('Sprint number already exists in project');
       }
killedBy: sprints_createSprintMutation createSprintDuplicateNumberInProject
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:59:11
       if (!project) throw new Error('Project not found');
 
       const existingNumber = await db.Sprint.findOne({ where: { projectID, number: sprintNumber } });
-      if (existingNumber) {
+      if (true) {
         throw new Error('Sprint number already exists in project');
       }
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint number already exists in project]]

[Killed] ObjectLiteral
graphql/mutations/createSprintMutation.js:63:51
         throw new Error('Sprint number already exists in project');
       }
 
-      const overlapping = await db.Sprint.findOne({
-        where: {
-          projectID,
-          [Op.or]: [
-            {
-              startDate: { [Op.lte]: endDate },
-              endDate: { [Op.gte]: startDate },
-            },
-          ],
-        },
-      });
+      const overlapping = await db.Sprint.findOne({});
 
       if (overlapping) {
killedBy: sprints_createSprintMutation createSprintOverlappingDifferentProject
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint dates overlap with an existing sprint in this project]]

[Killed] ArrayDeclaration
graphql/mutations/createSprintMutation.js:66:20
       const overlapping = await db.Sprint.findOne({
         where: {
           projectID,
-          [Op.or]: [
-            {
-              startDate: { [Op.lte]: endDate },
-              endDate: { [Op.gte]: startDate },
-            },
-          ],
+          [Op.or]: [],
         },
       });
killedBy: sprints_createSprintMutation createSprintDatesOverlap
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
graphql/mutations/createSprintMutation.js:75:24
         },
       });
 
-      if (overlapping) {
-        throw new Error('Sprint dates overlap with an existing sprint in this project');
-      }
+      if (overlapping) {}
     }
 
killedBy: sprints_createSprintMutation createSprintDatesOverlap
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:75:11
         },
       });
 
-      if (overlapping) {
+      if (true) {
         throw new Error('Sprint dates overlap with an existing sprint in this project');
       }
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint dates overlap with an existing sprint in this project]]

[Killed] LogicalOperator
graphql/mutations/createSprintMutation.js:82:20
 
     const sprint = await db.Sprint.create({
       number: sprintNumber,
-      description: description || null,
+      description: description && null,
       startDate,
       endDate,
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Sprint description"
Received: null

[Killed] ConditionalExpression
graphql/mutations/createSprintMutation.js:82:20
 
     const sprint = await db.Sprint.create({
       number: sprintNumber,
-      description: description || null,
+      description: true,
       startDate,
       endDate,
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Sprint description"
Received: "1"

[Killed] ObjectLiteral
graphql/mutations/createSprintMutation.js:89:17
     });
 
     return db.Sprint.findByPk(sprint.sprintID, {
-      include: [{ model: db.Project, as: 'project' }],
+      include: [{}],
     });
   },
killedBy: sprints_createSprintMutation createSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Include unexpected. Element has to be either a Model, an Association or an object.]]
