[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:16:72
     const creator = getViewer(context);
     const reporterId = creator.userID;
 
-    if (!Object.prototype.hasOwnProperty.call(input, 'name') || String(input.name || '').trim() === '') {
+    if (!Object.prototype.hasOwnProperty.call(input, 'name') || String(false).trim() === '') {
       throw new Error('Task name is required');
     }
killedBy: tasks_createTaskMutation createTaskEmptyName
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Task name is required"
Received message:   "Validation error: Validation notEmpty on name failed,
Validation error: Validation len on name failed"

      173 |         }
      174 |       }

[Killed] LogicalOperator
graphql/mutations/createTaskMutation.js:16:72
     const creator = getViewer(context);
     const reporterId = creator.userID;
 
-    if (!Object.prototype.hasOwnProperty.call(input, 'name') || String(input.name || '').trim() === '') {
+    if (!Object.prototype.hasOwnProperty.call(input, 'name') || String(input.name && '').trim() === '') {
       throw new Error('Task name is required');
     }
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] StringLiteral
graphql/mutations/createTaskMutation.js:17:23
     const reporterId = creator.userID;
 
     if (!Object.prototype.hasOwnProperty.call(input, 'name') || String(input.name || '').trim() === '') {
-      throw new Error('Task name is required');
+      throw new Error("");
     }
     const name = String(input.name);
killedBy: tasks_createTaskMutation createTaskMissingName
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Task name is required"
Received: ""

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:21:9
     }
     const name = String(input.name);
 
-    if (name.length > 200) throw new Error('Task name must be at most 200 characters');
+    if (false) throw new Error('Task name must be at most 200 characters');
 
     const description = (() => {
killedBy: tasks_createTaskMutation createTaskNameTooLong
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Task name must be at most 200 characters"
Received: "Validation error: Validation len on name failed"

[Killed] EqualityOperator
graphql/mutations/createTaskMutation.js:21:9
     }
     const name = String(input.name);
 
-    if (name.length > 200) throw new Error('Task name must be at most 200 characters');
+    if (name.length >= 200) throw new Error('Task name must be at most 200 characters');
 
     const description = (() => {
killedBy: tasks_createTaskMutation createTaskNameAndDescriptionMaxAllowed
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Task name must be at most 200 characters]]

[Killed] BlockStatement
graphql/mutations/createTaskMutation.js:23:32
 
     if (name.length > 200) throw new Error('Task name must be at most 200 characters');
 
-    const description = (() => {
-      const hasDescription = Object.prototype.hasOwnProperty.call(input, 'description');
-      if (!hasDescription) {
-        throw new Error('Task description is required');
-      }
-      if (input.description === null) {
-        throw new Error('Task description is required');
-      }
-      const trimmed = String(input.description).trim();
-      if (trimmed === '') throw new Error('Task description is required');
-      if (trimmed.length > 2000) throw new Error('Task description must be at most 2000 characters');
-      return trimmed;
-    })();
+    const description = (() => {})();
 
     const ALLOWED_STATUSES = new Set(['Open', 'In Progress', 'Done', 'Closed']);
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:25:11
 
     const description = (() => {
       const hasDescription = Object.prototype.hasOwnProperty.call(input, 'description');
-      if (!hasDescription) {
+      if (true) {
         throw new Error('Task description is required');
       }
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] BooleanLiteral
graphql/mutations/createTaskMutation.js:25:11
 
     const description = (() => {
       const hasDescription = Object.prototype.hasOwnProperty.call(input, 'description');
-      if (!hasDescription) {
+      if (hasDescription) {
         throw new Error('Task description is required');
       }
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:28:11
       if (!hasDescription) {
         throw new Error('Task description is required');
       }
-      if (input.description === null) {
+      if (false) {
         throw new Error('Task description is required');
       }
killedBy: tasks_createTaskMutation createTaskNullDescription
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Killed] EqualityOperator
graphql/mutations/createTaskMutation.js:28:11
       if (!hasDescription) {
         throw new Error('Task description is required');
       }
-      if (input.description === null) {
+      if (input.description !== null) {
         throw new Error('Task description is required');
       }
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] MethodExpression
graphql/mutations/createTaskMutation.js:31:23
       if (input.description === null) {
         throw new Error('Task description is required');
       }
-      const trimmed = String(input.description).trim();
+      const trimmed = String(input.description);
       if (trimmed === '') throw new Error('Task description is required');
       if (trimmed.length > 2000) throw new Error('Task description must be at most 2000 characters');
killedBy: tasks_createTaskMutation createTaskDescriptionWhitespace
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Task description is required"
Received message:   "Project not found"

      152 |         })
      153 |       }));
    > 154 |       if (stryMutAct_9fa48("406") ? false : stryMutAct_9fa48("405") ? true : stryMutAct_9fa48("404") ? project : (stryCov_9fa48("404", "405", "406"), !project)) throw new Error(stryMutAct_9fa48("407"

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:32:11
         throw new Error('Task description is required');
       }
       const trimmed = String(input.description).trim();
-      if (trimmed === '') throw new Error('Task description is required');
+      if (false) throw new Error('Task description is required');
       if (trimmed.length > 2000) throw new Error('Task description must be at most 2000 characters');
       return trimmed;
killedBy: tasks_createTaskMutation createTaskDescriptionWhitespace
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Task description is required"
Received message:   "Project not found"

      152 |         })
      153 |       }));
    > 154 |       if (stryMutAct_9fa48("406") ? false : stryMutAct_9fa48("405") ? true : stryMutAct_9fa48("404") ? project : (stryCov_9fa48("404", "405", "406"), !project)) throw new Error(stryMutAct_9fa48("407"

[Killed] EqualityOperator
graphql/mutations/createTaskMutation.js:32:11
         throw new Error('Task description is required');
       }
       const trimmed = String(input.description).trim();
-      if (trimmed === '') throw new Error('Task description is required');
+      if (trimmed !== '') throw new Error('Task description is required');
       if (trimmed.length > 2000) throw new Error('Task description must be at most 2000 characters');
       return trimmed;
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] EqualityOperator
graphql/mutations/createTaskMutation.js:33:11
       }
       const trimmed = String(input.description).trim();
       if (trimmed === '') throw new Error('Task description is required');
-      if (trimmed.length > 2000) throw new Error('Task description must be at most 2000 characters');
+      if (trimmed.length <= 2000) throw new Error('Task description must be at most 2000 characters');
       return trimmed;
     })();
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:33:11
       }
       const trimmed = String(input.description).trim();
       if (trimmed === '') throw new Error('Task description is required');
-      if (trimmed.length > 2000) throw new Error('Task description must be at most 2000 characters');
+      if (false) throw new Error('Task description must be at most 2000 characters');
       return trimmed;
     })();
killedBy: tasks_createTaskMutation createTaskDescriptionTooLong
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Task description must be at most 2000 characters"
Received: "Validation error: Validation len on description failed"

[Killed] ArrayDeclaration
graphql/mutations/createTaskMutation.js:37:38
       return trimmed;
     })();
 
-    const ALLOWED_STATUSES = new Set(['Open', 'In Progress', 'Done', 'Closed']);
+    const ALLOWED_STATUSES = new Set([]);
     const statusProvided = Object.prototype.hasOwnProperty.call(input, 'status') && input.status !== null;
     if (statusProvided && !ALLOWED_STATUSES.has(String(input.status))) throw new Error('Invalid status');
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:38:28
     })();
 
     const ALLOWED_STATUSES = new Set(['Open', 'In Progress', 'Done', 'Closed']);
-    const statusProvided = Object.prototype.hasOwnProperty.call(input, 'status') && input.status !== null;
+    const statusProvided = false;
     if (statusProvided && !ALLOWED_STATUSES.has(String(input.status))) throw new Error('Invalid status');
 
killedBy: tasks_createTaskMutation createTaskInvalidStatus
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] LogicalOperator
graphql/mutations/createTaskMutation.js:38:28
     })();
 
     const ALLOWED_STATUSES = new Set(['Open', 'In Progress', 'Done', 'Closed']);
-    const statusProvided = Object.prototype.hasOwnProperty.call(input, 'status') && input.status !== null;
+    const statusProvided = Object.prototype.hasOwnProperty.call(input, 'status') || input.status !== null;
     if (statusProvided && !ALLOWED_STATUSES.has(String(input.status))) throw new Error('Invalid status');
 
killedBy: tasks_createTaskMutation createTaskWhitespaceProjectName
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Project name is required"
Received message:   "Invalid status"

[Killed] BooleanLiteral
graphql/mutations/createTaskMutation.js:39:27
 
     const ALLOWED_STATUSES = new Set(['Open', 'In Progress', 'Done', 'Closed']);
     const statusProvided = Object.prototype.hasOwnProperty.call(input, 'status') && input.status !== null;
-    if (statusProvided && !ALLOWED_STATUSES.has(String(input.status))) throw new Error('Invalid status');
+    if (statusProvided && ALLOWED_STATUSES.has(String(input.status))) throw new Error('Invalid status');
 
     let assigneeUserID = null;
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:39:9
 
     const ALLOWED_STATUSES = new Set(['Open', 'In Progress', 'Done', 'Closed']);
     const statusProvided = Object.prototype.hasOwnProperty.call(input, 'status') && input.status !== null;
-    if (statusProvided && !ALLOWED_STATUSES.has(String(input.status))) throw new Error('Invalid status');
+    if (false) throw new Error('Invalid status');
 
     let assigneeUserID = null;
killedBy: tasks_createTaskMutation createTaskInvalidStatus
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:42:9
     if (statusProvided && !ALLOWED_STATUSES.has(String(input.status))) throw new Error('Invalid status');
 
     let assigneeUserID = null;
-    if (input.assigneeUsername) {
+    if (false) {
       const assignee = await db.User.findOne({ where: { username: input.assigneeUsername } });
       if (!assignee) throw new Error('Assignee not found');
killedBy: tasks_createTaskMutation createTaskAssigneeNotFound
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:42:9
     if (statusProvided && !ALLOWED_STATUSES.has(String(input.status))) throw new Error('Invalid status');
 
     let assigneeUserID = null;
-    if (input.assigneeUsername) {
+    if (true) {
       const assignee = await db.User.findOne({ where: { username: input.assigneeUsername } });
       if (!assignee) throw new Error('Assignee not found');
killedBy: tasks_createTaskMutation createTaskProjectNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Project not found"
Received: "WHERE parameter \"username\" has invalid \"undefined\" value"

[Killed] ObjectLiteral
graphql/mutations/createTaskMutation.js:43:46
 
     let assigneeUserID = null;
     if (input.assigneeUsername) {
-      const assignee = await db.User.findOne({ where: { username: input.assigneeUsername } });
+      const assignee = await db.User.findOne({});
       if (!assignee) throw new Error('Assignee not found');
       assigneeUserID = assignee.userID;
killedBy: tasks_createTaskMutation createTaskAssigneeNotFound
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:44:11
     let assigneeUserID = null;
     if (input.assigneeUsername) {
       const assignee = await db.User.findOne({ where: { username: input.assigneeUsername } });
-      if (!assignee) throw new Error('Assignee not found');
+      if (true) throw new Error('Assignee not found');
       assigneeUserID = assignee.userID;
     }
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] BlockStatement
graphql/mutations/createTaskMutation.js:50:30
 
     let projectID = null;
     const hasProjectNameProp = Object.prototype.hasOwnProperty.call(input, 'projectName');
-    if (!hasProjectNameProp) {
-      throw new Error('Project name is required');
-    }
+    if (!hasProjectNameProp) {}
     if (input.projectName === null) {
       throw new Error('Project name is required');
killedBy: tasks_createTaskMutation createTaskMissingProject
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Project name is required"
Received: "Cannot read properties of undefined (reading 'trim')"

[Killed] BooleanLiteral
graphql/mutations/createTaskMutation.js:50:9
 
     let projectID = null;
     const hasProjectNameProp = Object.prototype.hasOwnProperty.call(input, 'projectName');
-    if (!hasProjectNameProp) {
+    if (hasProjectNameProp) {
       throw new Error('Project name is required');
     }
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] BlockStatement
graphql/mutations/createTaskMutation.js:53:37
     if (!hasProjectNameProp) {
       throw new Error('Project name is required');
     }
-    if (input.projectName === null) {
-      throw new Error('Project name is required');
-    }
+    if (input.projectName === null) {}
     const providedProjectName = input.projectName.trim();
     if (providedProjectName === '') throw new Error('Project name is required');
killedBy: tasks_createTaskMutation createTaskNullProjectName
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Project name is required"
Received message:   "Cannot read properties of null (reading 'trim')"

      145 |         }
      146 |       }
    > 147 |       const providedProjectName = stryMutAct_9fa48("396") ? input.projectName : (stryCov_9fa48("396"), input.projectName.trim());

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:53:9
     if (!hasProjectNameProp) {
       throw new Error('Project name is required');
     }
-    if (input.projectName === null) {
+    if (false) {
       throw new Error('Project name is required');
     }
killedBy: tasks_createTaskMutation createTaskNullProjectName
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Project name is required"
Received message:   "Cannot read properties of null (reading 'trim')"

      145 |         }
      146 |       }
    > 147 |       const providedProjectName = stryMutAct_9fa48("396") ? input.projectName : (stryCov_9fa48("396"), input.projectName.trim());

[Killed] MethodExpression
graphql/mutations/createTaskMutation.js:56:33
     if (input.projectName === null) {
       throw new Error('Project name is required');
     }
-    const providedProjectName = input.projectName.trim();
+    const providedProjectName = input.projectName;
     if (providedProjectName === '') throw new Error('Project name is required');
     const project = await db.Project.findOne({ where: { name: providedProjectName } });
killedBy: tasks_createTaskMutation createTaskWhitespaceProjectName
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Project name is required"
Received: "Project not found"

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:57:9
       throw new Error('Project name is required');
     }
     const providedProjectName = input.projectName.trim();
-    if (providedProjectName === '') throw new Error('Project name is required');
+    if (false) throw new Error('Project name is required');
     const project = await db.Project.findOne({ where: { name: providedProjectName } });
     if (!project) throw new Error('Project not found');
killedBy: tasks_createTaskMutation createTaskWhitespaceProjectName
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Project name is required"
Received: "Project not found"

[Killed] EqualityOperator
graphql/mutations/createTaskMutation.js:57:9
       throw new Error('Project name is required');
     }
     const providedProjectName = input.projectName.trim();
-    if (providedProjectName === '') throw new Error('Project name is required');
+    if (providedProjectName !== '') throw new Error('Project name is required');
     const project = await db.Project.findOne({ where: { name: providedProjectName } });
     if (!project) throw new Error('Project not found');
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:59:9
     const providedProjectName = input.projectName.trim();
     if (providedProjectName === '') throw new Error('Project name is required');
     const project = await db.Project.findOne({ where: { name: providedProjectName } });
-    if (!project) throw new Error('Project not found');
+    if (false) throw new Error('Project not found');
     projectID = project.projectID;
 
killedBy: tasks_createTaskMutation createTaskProjectNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Project not found"
Received: "Cannot read properties of null (reading 'projectID')"

[Killed] BooleanLiteral
graphql/mutations/createTaskMutation.js:59:9
     const providedProjectName = input.projectName.trim();
     if (providedProjectName === '') throw new Error('Project name is required');
     const project = await db.Project.findOne({ where: { name: providedProjectName } });
-    if (!project) throw new Error('Project not found');
+    if (project) throw new Error('Project not found');
     projectID = project.projectID;
 
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] BlockStatement
graphql/mutations/createTaskMutation.js:64:24
 
     let sprintID = null;
     const hasSprintProp = Object.prototype.hasOwnProperty.call(input, 'sprintNumber');
-    if (hasSprintProp) {
-      const num = Number(input.sprintNumber);
-      const sprintWhere = { number: num, projectID };
-      const sprint = await db.Sprint.findOne({ where: sprintWhere });
-      if (!sprint) throw new Error('Sprint not found');
-      sprintID = sprint.sprintID;
-    }
+    if (hasSprintProp) {}
 
     const newTask = await db.Task.create({
killedBy: tasks_createTaskMutation createTaskSprintNotFound
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:64:9
 
     let sprintID = null;
     const hasSprintProp = Object.prototype.hasOwnProperty.call(input, 'sprintNumber');
-    if (hasSprintProp) {
+    if (true) {
       const num = Number(input.sprintNumber);
       const sprintWhere = { number: num, projectID };
killedBy: tasks_createTaskMutation createTaskNullStatus
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: SQLITE_ERROR: no such column: NaN]]

[Killed] ConditionalExpression
graphql/mutations/createTaskMutation.js:68:11
       const num = Number(input.sprintNumber);
       const sprintWhere = { number: num, projectID };
       const sprint = await db.Sprint.findOne({ where: sprintWhere });
-      if (!sprint) throw new Error('Sprint not found');
+      if (false) throw new Error('Sprint not found');
       sprintID = sprint.sprintID;
     }
killedBy: tasks_createTaskMutation createTaskSprintNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Sprint not found"
Received: "Cannot read properties of null (reading 'sprintID')"

[Killed] BooleanLiteral
graphql/mutations/createTaskMutation.js:68:11
       const num = Number(input.sprintNumber);
       const sprintWhere = { number: num, projectID };
       const sprint = await db.Sprint.findOne({ where: sprintWhere });
-      if (!sprint) throw new Error('Sprint not found');
+      if (sprint) throw new Error('Sprint not found');
       sprintID = sprint.sprintID;
     }
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ArrayDeclaration
graphql/mutations/createTaskMutation.js:84:65
 
     // Return task 
     const includes = [];
-    includes.push({ model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] });
+    includes.push({ model: db.User, as: 'reporter', attributes: [] });
     includes.push({ model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] });
     includes.push({ model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] });
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ArrayContaining ["userID", "username", "email"]
Received: []

[Killed] StringLiteral
graphql/mutations/createTaskMutation.js:85:41
     // Return task 
     const includes = [];
     includes.push({ model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] });
-    includes.push({ model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] });
+    includes.push({ model: db.User, as: "", attributes: ['userID', 'username', 'email'] });
     includes.push({ model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] });
     includes.push({ model: db.Project, as: 'project', attributes: ['projectID', 'name'] });
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "assignee",
+   "",

[Killed] ObjectLiteral
graphql/mutations/createTaskMutation.js:85:19
     // Return task 
     const includes = [];
     includes.push({ model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] });
-    includes.push({ model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] });
+    includes.push({});
     includes.push({ model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] });
     includes.push({ model: db.Project, as: 'project', attributes: ['projectID', 'name'] });
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "assignee",
    "project",

[Killed] StringLiteral
graphql/mutations/createTaskMutation.js:86:43
     const includes = [];
     includes.push({ model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] });
     includes.push({ model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] });
-    includes.push({ model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] });
+    includes.push({ model: db.Sprint, as: "", attributes: ['sprintID', 'number'] });
     includes.push({ model: db.Project, as: 'project', attributes: ['projectID', 'name'] });
 
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "",
    "assignee",

[Killed] StringLiteral
graphql/mutations/createTaskMutation.js:87:68
     includes.push({ model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] });
     includes.push({ model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] });
     includes.push({ model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] });
-    includes.push({ model: db.Project, as: 'project', attributes: ['projectID', 'name'] });
+    includes.push({ model: db.Project, as: 'project', attributes: ["", 'name'] });
 
     const task = await db.Task.findByPk(newTask.taskID, { include: includes });
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ArrayContaining ["projectID", "name"]
Received: ["", "name"]

[Killed] StringLiteral
graphql/mutations/createTaskMutation.js:87:81
     includes.push({ model: db.User, as: 'reporter', attributes: ['userID', 'username', 'email'] });
     includes.push({ model: db.User, as: 'assignee', attributes: ['userID', 'username', 'email'] });
     includes.push({ model: db.Sprint, as: 'sprint', attributes: ['sprintID', 'number'] });
-    includes.push({ model: db.Project, as: 'project', attributes: ['projectID', 'name'] });
+    includes.push({ model: db.Project, as: 'project', attributes: ['projectID', ""] });
 
     const task = await db.Task.findByPk(newTask.taskID, { include: includes });
killedBy: tasks_createTaskMutation createTaskAllValid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ArrayContaining ["projectID", "name"]
Received: ["projectID", ""]
