[Killed] BlockStatement
graphql/mutations/deleteSprintMutation.js:10:54
   args: {
     sprintID: { type: new GraphQLNonNull(GraphQLInt) },
   },
-  resolve: async (_source, { sprintID }, context) => {
-    authorizeRoles(context, ['Admin', 'Manager']);
-
-    const sprint = await db.Sprint.findByPk(sprintID);
-    if (!sprint) throw new Error('Sprint not found');
-
-    await sprint.destroy();
-    return `Sprint deleted`;
-  },
+  resolve: async (_source, { sprintID }, context) => {},
 };
killedBy: sprints_deleteSprintMutation deleteSprintNotFound
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
graphql/mutations/deleteSprintMutation.js:11:30
     sprintID: { type: new GraphQLNonNull(GraphQLInt) },
   },
   resolve: async (_source, { sprintID }, context) => {
-    authorizeRoles(context, ['Admin', 'Manager']);
+    authorizeRoles(context, ["", 'Manager']);
 
     const sprint = await db.Sprint.findByPk(sprintID);
killedBy: sprints_deleteSprintMutation deleteSprintAsAdmin
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Not authorized]]

[Killed] ConditionalExpression
graphql/mutations/deleteSprintMutation.js:14:9
     authorizeRoles(context, ['Admin', 'Manager']);
 
     const sprint = await db.Sprint.findByPk(sprintID);
-    if (!sprint) throw new Error('Sprint not found');
+    if (true) throw new Error('Sprint not found');
 
     await sprint.destroy();
killedBy: sprints_deleteSprintMutation deleteSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint not found]]

[Killed] ConditionalExpression
graphql/mutations/deleteSprintMutation.js:14:9
     authorizeRoles(context, ['Admin', 'Manager']);
 
     const sprint = await db.Sprint.findByPk(sprintID);
-    if (!sprint) throw new Error('Sprint not found');
+    if (false) throw new Error('Sprint not found');
 
     await sprint.destroy();
killedBy: sprints_deleteSprintMutation deleteSprintNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Sprint not found"
Received: "Cannot read properties of null (reading 'destroy')"
