[Killed] BlockStatement
graphql/mutations/deleteTaskMutation.js:10:52
   args: {
     taskID: { type: new GraphQLNonNull(GraphQLInt) },
   },
-  resolve: async (_source, { taskID }, context) => {
-    authorizeRoles(context, ['Admin', 'Manager']);
-
-    const task = await db.Task.findByPk(taskID);
-    if (!task) throw new Error('Task not found');
-
-    await task.destroy();
-    return `Task deleted`;
-  },
+  resolve: async (_source, { taskID }, context) => {},
 };
killedBy: tasks_deleteTaskMutation deleteTaskNotFound
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
graphql/mutations/deleteTaskMutation.js:11:30
     taskID: { type: new GraphQLNonNull(GraphQLInt) },
   },
   resolve: async (_source, { taskID }, context) => {
-    authorizeRoles(context, ['Admin', 'Manager']);
+    authorizeRoles(context, ["", 'Manager']);
 
     const task = await db.Task.findByPk(taskID);
killedBy: tasks_deleteTaskMutation deleteTaskAllValidAsAdmin
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Not authorized]]

[Killed] ConditionalExpression
graphql/mutations/deleteTaskMutation.js:14:9
     authorizeRoles(context, ['Admin', 'Manager']);
 
     const task = await db.Task.findByPk(taskID);
-    if (!task) throw new Error('Task not found');
+    if (false) throw new Error('Task not found');
 
     await task.destroy();
killedBy: tasks_deleteTaskMutation deleteTaskNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Task not found"
Received: "Cannot read properties of null (reading 'destroy')"

[Killed] ConditionalExpression
graphql/mutations/deleteTaskMutation.js:14:9
     authorizeRoles(context, ['Admin', 'Manager']);
 
     const task = await db.Task.findByPk(taskID);
-    if (!task) throw new Error('Task not found');
+    if (true) throw new Error('Task not found');
 
     await task.destroy();
killedBy: tasks_deleteTaskMutation deleteTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Task not found]]

[Killed] StringLiteral
graphql/mutations/deleteTaskMutation.js:17:12
     if (!task) throw new Error('Task not found');
 
     await task.destroy();
-    return `Task deleted`;
+    return ``;
   },
 };
killedBy: tasks_deleteTaskMutation deleteTaskAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Task deleted"
Received: ""
