[Killed] ObjectLiteral
graphql/mutations/updateSprintMutation.js:15:18
     input: { type: new GraphQLNonNull(UpdateSprintInput) },
   },
   resolve: async (_source, { input }, context) => {
-    const args = { ...input };
+    const args = {};
 
     // only Admins and Managers can perform this action
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint not found]]

[Killed] StringLiteral
graphql/mutations/updateSprintMutation.js:18:39
     const args = { ...input };
 
     // only Admins and Managers can perform this action
-    authorizeRoles(context, ['Admin', 'Manager']);
+    authorizeRoles(context, ['Admin', ""]);
 
     const sprint = await db.Sprint.findByPk(args.sprintID);
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Not authorized]]

[Killed] BooleanLiteral
graphql/mutations/updateSprintMutation.js:21:9
     authorizeRoles(context, ['Admin', 'Manager']);
 
     const sprint = await db.Sprint.findByPk(args.sprintID);
-    if (!sprint) throw new Error('Sprint not found');
+    if (sprint) throw new Error('Sprint not found');
 
     let sprintNumber;
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint not found]]

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:21:9
     authorizeRoles(context, ['Admin', 'Manager']);
 
     const sprint = await db.Sprint.findByPk(args.sprintID);
-    if (!sprint) throw new Error('Sprint not found');
+    if (false) throw new Error('Sprint not found');
 
     let sprintNumber;
killedBy: sprints_updateSprintMutation updateSprintSprintNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Sprint not found"
Received: "Cannot read properties of null (reading 'projectID')"

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:24:9
     if (!sprint) throw new Error('Sprint not found');
 
     let sprintNumber;
-    if (Object.prototype.hasOwnProperty.call(args, SPRINT_NUMBER)) {
+    if (false) {
       sprintNumber = Number(args[SPRINT_NUMBER]);
       if (!Number.isInteger(sprintNumber)) {
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
graphql/mutations/updateSprintMutation.js:24:68
     if (!sprint) throw new Error('Sprint not found');
 
     let sprintNumber;
-    if (Object.prototype.hasOwnProperty.call(args, SPRINT_NUMBER)) {
-      sprintNumber = Number(args[SPRINT_NUMBER]);
-      if (!Number.isInteger(sprintNumber)) {
-        throw new Error('Sprint number must be an integer');
-      }
-      if (sprintNumber < 1) {
-        throw new Error('Sprint number must be greater than or equal to 1');
-      }
-      args.number = sprintNumber;
-      delete args.sprintNumber;
-    }
+    if (Object.prototype.hasOwnProperty.call(args, SPRINT_NUMBER)) {}
 
     if (typeof args.description === 'string') {
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BooleanLiteral
graphql/mutations/updateSprintMutation.js:26:11
     let sprintNumber;
     if (Object.prototype.hasOwnProperty.call(args, SPRINT_NUMBER)) {
       sprintNumber = Number(args[SPRINT_NUMBER]);
-      if (!Number.isInteger(sprintNumber)) {
+      if (Number.isInteger(sprintNumber)) {
         throw new Error('Sprint number must be an integer');
       }
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint number must be an integer]]

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:26:11
     let sprintNumber;
     if (Object.prototype.hasOwnProperty.call(args, SPRINT_NUMBER)) {
       sprintNumber = Number(args[SPRINT_NUMBER]);
-      if (!Number.isInteger(sprintNumber)) {
+      if (true) {
         throw new Error('Sprint number must be an integer');
       }
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint number must be an integer]]

[Killed] EqualityOperator
graphql/mutations/updateSprintMutation.js:29:11
       if (!Number.isInteger(sprintNumber)) {
         throw new Error('Sprint number must be an integer');
       }
-      if (sprintNumber < 1) {
+      if (sprintNumber >= 1) {
         throw new Error('Sprint number must be greater than or equal to 1');
       }
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint number must be greater than or equal to 1]]

[Killed] BlockStatement
graphql/mutations/updateSprintMutation.js:29:29
       if (!Number.isInteger(sprintNumber)) {
         throw new Error('Sprint number must be an integer');
       }
-      if (sprintNumber < 1) {
-        throw new Error('Sprint number must be greater than or equal to 1');
-      }
+      if (sprintNumber < 1) {}
       args.number = sprintNumber;
       delete args.sprintNumber;
killedBy: sprints_updateSprintMutation updateSprintNumberZeroInvalid
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
graphql/mutations/updateSprintMutation.js:36:47
       delete args.sprintNumber;
     }
 
-    if (typeof args.description === 'string') {
-      const trimmedDescription = args.description.trim();
-      if (trimmedDescription.length > 2000) throw new Error('Sprint description must be at most 2000 characters');
-      args.description = trimmedDescription;
-    }
+    if (typeof args.description === 'string') {}
 
     if (Object.prototype.hasOwnProperty.call(args, 'projectID') && args.projectID !== null && args.projectID !== undefined) {
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New sprint description"
Received: "   New sprint description   "

[Killed] EqualityOperator
graphql/mutations/updateSprintMutation.js:36:9
       delete args.sprintNumber;
     }
 
-    if (typeof args.description === 'string') {
+    if (typeof args.description !== 'string') {
       const trimmedDescription = args.description.trim();
       if (trimmedDescription.length > 2000) throw new Error('Sprint description must be at most 2000 characters');
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New sprint description"
Received: "   New sprint description   "

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:38:11
 
     if (typeof args.description === 'string') {
       const trimmedDescription = args.description.trim();
-      if (trimmedDescription.length > 2000) throw new Error('Sprint description must be at most 2000 characters');
+      if (true) throw new Error('Sprint description must be at most 2000 characters');
       args.description = trimmedDescription;
     }
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint description must be at most 2000 characters]]

[Killed] EqualityOperator
graphql/mutations/updateSprintMutation.js:38:11
 
     if (typeof args.description === 'string') {
       const trimmedDescription = args.description.trim();
-      if (trimmedDescription.length > 2000) throw new Error('Sprint description must be at most 2000 characters');
+      if (trimmedDescription.length >= 2000) throw new Error('Sprint description must be at most 2000 characters');
       args.description = trimmedDescription;
     }
killedBy: sprints_updateSprintMutation updateSprintDescriptionAtBoundary
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint description must be at most 2000 characters]]

[Killed] LogicalOperator
graphql/mutations/updateSprintMutation.js:42:9
       args.description = trimmedDescription;
     }
 
-    if (Object.prototype.hasOwnProperty.call(args, 'projectID') && args.projectID !== null && args.projectID !== undefined) {
+    if (Object.prototype.hasOwnProperty.call(args, 'projectID') || args.projectID !== null && args.projectID !== undefined) {
       const project = await db.Project.findByPk(args.projectID);
       if (!project) throw new Error('Project not found');
killedBy: sprints_updateSprintMutation updateSprintNumberWithProjectNull
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project not found]]

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:42:68
       args.description = trimmedDescription;
     }
 
-    if (Object.prototype.hasOwnProperty.call(args, 'projectID') && args.projectID !== null && args.projectID !== undefined) {
+    if (Object.prototype.hasOwnProperty.call(args, 'projectID') && true && args.projectID !== undefined) {
       const project = await db.Project.findByPk(args.projectID);
       if (!project) throw new Error('Project not found');
killedBy: sprints_updateSprintMutation updateSprintNumberWithProjectNull
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project not found]]

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:44:11
 
     if (Object.prototype.hasOwnProperty.call(args, 'projectID') && args.projectID !== null && args.projectID !== undefined) {
       const project = await db.Project.findByPk(args.projectID);
-      if (!project) throw new Error('Project not found');
+      if (true) throw new Error('Project not found');
     }
 
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project not found]]

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:48:10
     }
 
     const targetProjectID = Object.prototype.hasOwnProperty.call(args, 'projectID')
-      ? (args.projectID === null ? sprint.projectID : args.projectID)
+      ? (false ? sprint.projectID : args.projectID)
       : sprint.projectID;
 
killedBy: sprints_updateSprintMutation updateSprintNumberWithProjectNullConflict
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
graphql/mutations/updateSprintMutation.js:48:10
     }
 
     const targetProjectID = Object.prototype.hasOwnProperty.call(args, 'projectID')
-      ? (args.projectID === null ? sprint.projectID : args.projectID)
+      ? (args.projectID !== null ? sprint.projectID : args.projectID)
       : sprint.projectID;
 
killedBy: sprints_updateSprintMutation updateSprintNumberWithProjectNullConflict
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:51:9
       ? (args.projectID === null ? sprint.projectID : args.projectID)
       : sprint.projectID;
 
-    if (Object.prototype.hasOwnProperty.call(args, 'startDate') || Object.prototype.hasOwnProperty.call(args, 'endDate')) {
+    if (false) {
       if (Object.prototype.hasOwnProperty.call(args, 'startDate') && args.startDate === '') {
         throw new Error('Start date is required');
killedBy: sprints_updateSprintMutation updateSprintDatesOverlap
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] LogicalOperator
graphql/mutations/updateSprintMutation.js:51:9
       ? (args.projectID === null ? sprint.projectID : args.projectID)
       : sprint.projectID;
 
-    if (Object.prototype.hasOwnProperty.call(args, 'startDate') || Object.prototype.hasOwnProperty.call(args, 'endDate')) {
+    if (Object.prototype.hasOwnProperty.call(args, 'startDate') && Object.prototype.hasOwnProperty.call(args, 'endDate')) {
       if (Object.prototype.hasOwnProperty.call(args, 'startDate') && args.startDate === '') {
         throw new Error('Start date is required');
killedBy: sprints_updateSprintMutation updateSprintInvalidDateFormat
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:52:11
       : sprint.projectID;
 
     if (Object.prototype.hasOwnProperty.call(args, 'startDate') || Object.prototype.hasOwnProperty.call(args, 'endDate')) {
-      if (Object.prototype.hasOwnProperty.call(args, 'startDate') && args.startDate === '') {
+      if (true) {
         throw new Error('Start date is required');
       }
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Start date is required]]

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:52:70
       : sprint.projectID;
 
     if (Object.prototype.hasOwnProperty.call(args, 'startDate') || Object.prototype.hasOwnProperty.call(args, 'endDate')) {
-      if (Object.prototype.hasOwnProperty.call(args, 'startDate') && args.startDate === '') {
+      if (Object.prototype.hasOwnProperty.call(args, 'startDate') && true) {
         throw new Error('Start date is required');
       }
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Start date is required]]

[Killed] EqualityOperator
graphql/mutations/updateSprintMutation.js:55:68
       if (Object.prototype.hasOwnProperty.call(args, 'startDate') && args.startDate === '') {
         throw new Error('Start date is required');
       }
-      if (Object.prototype.hasOwnProperty.call(args, 'endDate') && args.endDate === '') {
+      if (Object.prototype.hasOwnProperty.call(args, 'endDate') && args.endDate !== '') {
         throw new Error('End date is required');
       }
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: End date is required]]

[Killed] LogicalOperator
graphql/mutations/updateSprintMutation.js:55:11
       if (Object.prototype.hasOwnProperty.call(args, 'startDate') && args.startDate === '') {
         throw new Error('Start date is required');
       }
-      if (Object.prototype.hasOwnProperty.call(args, 'endDate') && args.endDate === '') {
+      if (Object.prototype.hasOwnProperty.call(args, 'endDate') || args.endDate === '') {
         throw new Error('End date is required');
       }
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: End date is required]]

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:59:30
         throw new Error('End date is required');
       }
 
-      const sDate = new Date(args.startDate || sprint.startDate);
+      const sDate = new Date(true);
       const eDate = new Date(args.endDate || sprint.endDate);
       if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {
killedBy: sprints_updateSprintMutation updateSprintInvalidDateFormat
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:59:30
         throw new Error('End date is required');
       }
 
-      const sDate = new Date(args.startDate || sprint.startDate);
+      const sDate = new Date(false);
       const eDate = new Date(args.endDate || sprint.endDate);
       if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {
killedBy: sprints_updateSprintMutation updateSprintInvalidDateFormat
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:60:30
       }
 
       const sDate = new Date(args.startDate || sprint.startDate);
-      const eDate = new Date(args.endDate || sprint.endDate);
+      const eDate = new Date(true);
       if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {
         throw new Error('Invalid date format');
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Start date must be before end date]]

[Killed] LogicalOperator
graphql/mutations/updateSprintMutation.js:60:30
       }
 
       const sDate = new Date(args.startDate || sprint.startDate);
-      const eDate = new Date(args.endDate || sprint.endDate);
+      const eDate = new Date(args.endDate && sprint.endDate);
       if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {
         throw new Error('Invalid date format');
killedBy: sprints_updateSprintMutation updateSprintProjectOverlapConflict
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Sprint dates overlap with an existing sprint in this project"
Received: "Start date must be before end date"

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:61:11
 
       const sDate = new Date(args.startDate || sprint.startDate);
       const eDate = new Date(args.endDate || sprint.endDate);
-      if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {
+      if (false) {
         throw new Error('Invalid date format');
       }
killedBy: sprints_updateSprintMutation updateSprintInvalidDateFormat
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
graphql/mutations/updateSprintMutation.js:61:61
 
       const sDate = new Date(args.startDate || sprint.startDate);
       const eDate = new Date(args.endDate || sprint.endDate);
-      if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {
-        throw new Error('Invalid date format');
-      }
+      if (isNaN(sDate.getTime()) || isNaN(eDate.getTime())) {}
 
       if (sDate >= eDate) {
killedBy: sprints_updateSprintMutation updateSprintInvalidDateFormat
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
graphql/mutations/updateSprintMutation.js:65:11
         throw new Error('Invalid date format');
       }
 
-      if (sDate >= eDate) {
+      if (sDate < eDate) {
         throw new Error('Start date must be before end date');
       }
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Start date must be before end date]]

[Killed] EqualityOperator
graphql/mutations/updateSprintMutation.js:65:11
         throw new Error('Invalid date format');
       }
 
-      if (sDate >= eDate) {
+      if (sDate > eDate) {
         throw new Error('Start date must be before end date');
       }
killedBy: sprints_updateSprintMutation updateSprintStartDateAfterEndDate
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
graphql/mutations/updateSprintMutation.js:66:25
       }
 
       if (sDate >= eDate) {
-        throw new Error('Start date must be before end date');
+        throw new Error("");
       }
 
killedBy: sprints_updateSprintMutation updateSprintStartDateAfterEndDate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Start date must be before end date"
Received: ""

[Killed] ObjectLiteral
graphql/mutations/updateSprintMutation.js:69:51
         throw new Error('Start date must be before end date');
       }
 
-      const overlapping = await db.Sprint.findOne({
-        where: {
-          projectID: targetProjectID,
-          sprintID: { [db.Sequelize.Op.ne]: sprint.sprintID },
-          [db.Sequelize.Op.and]: [
-            { startDate: { [db.Sequelize.Op.lte]: eDate } },
-            { endDate: { [db.Sequelize.Op.gte]: sDate } },
-          ],
-        },
-      });
+      const overlapping = await db.Sprint.findOne({});
 
       if (overlapping) throw new Error('Sprint dates overlap with an existing sprint in this project');
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint dates overlap with an existing sprint in this project]]

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:80:11
         },
       });
 
-      if (overlapping) throw new Error('Sprint dates overlap with an existing sprint in this project');
+      if (false) throw new Error('Sprint dates overlap with an existing sprint in this project');
     }
 
killedBy: sprints_updateSprintMutation updateSprintDatesOverlap
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:80:11
         },
       });
 
-      if (overlapping) throw new Error('Sprint dates overlap with an existing sprint in this project');
+      if (true) throw new Error('Sprint dates overlap with an existing sprint in this project');
     }
 
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint dates overlap with an existing sprint in this project]]

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:83:9
       if (overlapping) throw new Error('Sprint dates overlap with an existing sprint in this project');
     }
 
-    if (sprintNumber !== undefined && targetProjectID) {
+    if (true) {
       const existingNumber = await db.Sprint.findOne({ where: { projectID: targetProjectID, number: sprintNumber } });
       if (existingNumber && existingNumber.sprintID !== sprint.sprintID) {
killedBy: sprints_updateSprintMutation updateSprintUndefinedProjectID
statusReason: Error: WHERE parameter "projectID" has invalid "undefined" value

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:83:9
       if (overlapping) throw new Error('Sprint dates overlap with an existing sprint in this project');
     }
 
-    if (sprintNumber !== undefined && targetProjectID) {
+    if (true && targetProjectID) {
       const existingNumber = await db.Sprint.findOne({ where: { projectID: targetProjectID, number: sprintNumber } });
       if (existingNumber && existingNumber.sprintID !== sprint.sprintID) {
killedBy: sprints_updateSprintMutation updateSprintChangeProjectWithoutNumber
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: WHERE parameter "number" has invalid "undefined" value]]

[Killed] ObjectLiteral
graphql/mutations/updateSprintMutation.js:84:63
     }
 
     if (sprintNumber !== undefined && targetProjectID) {
-      const existingNumber = await db.Sprint.findOne({ where: { projectID: targetProjectID, number: sprintNumber } });
+      const existingNumber = await db.Sprint.findOne({ where: {} });
       if (existingNumber && existingNumber.sprintID !== sprint.sprintID) {
         throw new Error('Sprint number already exists in project');
killedBy: sprints_updateSprintMutation updateSprintDuplicateNumberDifferentProject
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint number already exists in project]]

[Killed] ConditionalExpression
graphql/mutations/updateSprintMutation.js:85:11
 
     if (sprintNumber !== undefined && targetProjectID) {
       const existingNumber = await db.Sprint.findOne({ where: { projectID: targetProjectID, number: sprintNumber } });
-      if (existingNumber && existingNumber.sprintID !== sprint.sprintID) {
+      if (false) {
         throw new Error('Sprint number already exists in project');
       }
killedBy: sprints_updateSprintMutation updateSprintDuplicateNumberInProject
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] LogicalOperator
graphql/mutations/updateSprintMutation.js:85:11
 
     if (sprintNumber !== undefined && targetProjectID) {
       const existingNumber = await db.Sprint.findOne({ where: { projectID: targetProjectID, number: sprintNumber } });
-      if (existingNumber && existingNumber.sprintID !== sprint.sprintID) {
+      if (existingNumber || existingNumber.sprintID !== sprint.sprintID) {
         throw new Error('Sprint number already exists in project');
       }
killedBy: sprints_updateSprintMutation updateSprintAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Cannot read properties of null (reading 'sprintID')]]

[Killed] ObjectLiteral
graphql/mutations/updateSprintMutation.js:92:48
 
     await sprint.update(args);
 
-    return db.Sprint.findByPk(sprint.sprintID, {
-      include: [{ model: db.Project, as: 'project' }]
-    });
+    return db.Sprint.findByPk(sprint.sprintID, {});
   },
 };
killedBy: sprints_updateSprintMutation updateSprintUndefinedProjectID
statusReason: Error: expect(received).toBeDefined()

Received: undefined
