[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:17:9
     const args = { ...input };
 
     const task = await db.Task.findByPk(args.taskID);
-    if (!task) throw new Error('Task not found');
+    if (true) throw new Error('Task not found');
 
     const updateTask = {};
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Task not found]]

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:17:9
     const args = { ...input };
 
     const task = await db.Task.findByPk(args.taskID);
-    if (!task) throw new Error('Task not found');
+    if (false) throw new Error('Task not found');
 
     const updateTask = {};
killedBy: tasks_updateTaskMutation updateTaskNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Task not found"
Received: "Cannot read properties of null (reading 'update')"

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:21:9
 
     const updateTask = {};
 
-    if (Object.prototype.hasOwnProperty.call(input, 'assigneeUsername')) {
+    if (false) {
       if (args.assigneeUsername === null) {
         throw new Error('Assignee cannot be set to null');
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'userID')

[Killed] BlockStatement
graphql/mutations/updateTaskMutation.js:21:74
 
     const updateTask = {};
 
-    if (Object.prototype.hasOwnProperty.call(input, 'assigneeUsername')) {
-      if (args.assigneeUsername === null) {
-        throw new Error('Assignee cannot be set to null');
-      } else {
-        const assignee = await db.User.findOne({ where: { username: args.assigneeUsername } });
-        if (!assignee) throw new Error('Assignee not found');
-        updateTask.assigneeUserID = assignee.userID;
-      }
-    }
+    if (Object.prototype.hasOwnProperty.call(input, 'assigneeUsername')) {}
 
     let projectFromInput = null;
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'userID')

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:22:11
     const updateTask = {};
 
     if (Object.prototype.hasOwnProperty.call(input, 'assigneeUsername')) {
-      if (args.assigneeUsername === null) {
+      if (true) {
         throw new Error('Assignee cannot be set to null');
       } else {
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Assignee cannot be set to null]]

[Killed] EqualityOperator
graphql/mutations/updateTaskMutation.js:22:11
     const updateTask = {};
 
     if (Object.prototype.hasOwnProperty.call(input, 'assigneeUsername')) {
-      if (args.assigneeUsername === null) {
+      if (args.assigneeUsername !== null) {
         throw new Error('Assignee cannot be set to null');
       } else {
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Assignee cannot be set to null]]

[Killed] BlockStatement
graphql/mutations/updateTaskMutation.js:24:14
     if (Object.prototype.hasOwnProperty.call(input, 'assigneeUsername')) {
       if (args.assigneeUsername === null) {
         throw new Error('Assignee cannot be set to null');
-      } else {
-        const assignee = await db.User.findOne({ where: { username: args.assigneeUsername } });
-        if (!assignee) throw new Error('Assignee not found');
-        updateTask.assigneeUserID = assignee.userID;
-      }
+      } else {}
     }
 
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'userID')

[Killed] ObjectLiteral
graphql/mutations/updateTaskMutation.js:25:48
       if (args.assigneeUsername === null) {
         throw new Error('Assignee cannot be set to null');
       } else {
-        const assignee = await db.User.findOne({ where: { username: args.assigneeUsername } });
+        const assignee = await db.User.findOne({});
         if (!assignee) throw new Error('Assignee not found');
         updateTask.assigneeUserID = assignee.userID;
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:26:13
         throw new Error('Assignee cannot be set to null');
       } else {
         const assignee = await db.User.findOne({ where: { username: args.assigneeUsername } });
-        if (!assignee) throw new Error('Assignee not found');
+        if (true) throw new Error('Assignee not found');
         updateTask.assigneeUserID = assignee.userID;
       }
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Assignee not found]]

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:26:13
         throw new Error('Assignee cannot be set to null');
       } else {
         const assignee = await db.User.findOne({ where: { username: args.assigneeUsername } });
-        if (!assignee) throw new Error('Assignee not found');
+        if (false) throw new Error('Assignee not found');
         updateTask.assigneeUserID = assignee.userID;
       }
killedBy: tasks_updateTaskMutation updateTaskAssigneeNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Assignee not found"
Received: "Cannot read properties of null (reading 'userID')"

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:32:9
     }
 
     let projectFromInput = null;
-    if (Object.prototype.hasOwnProperty.call(input, 'projectName')) {
+    if (false) {
       if (args.projectName === null) {
         throw new Error('Project cannot be set to null');
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:32:9
     }
 
     let projectFromInput = null;
-    if (Object.prototype.hasOwnProperty.call(input, 'projectName')) {
+    if (true) {
       if (args.projectName === null) {
         throw new Error('Project cannot be set to null');
killedBy: tasks_updateTaskMutation updateTaskSprintNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Sprint not found"
Received: "WHERE parameter \"name\" has invalid \"undefined\" value"

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:33:11
 
     let projectFromInput = null;
     if (Object.prototype.hasOwnProperty.call(input, 'projectName')) {
-      if (args.projectName === null) {
+      if (true) {
         throw new Error('Project cannot be set to null');
       } else {
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project cannot be set to null]]

[Killed] BlockStatement
graphql/mutations/updateTaskMutation.js:33:38
 
     let projectFromInput = null;
     if (Object.prototype.hasOwnProperty.call(input, 'projectName')) {
-      if (args.projectName === null) {
-        throw new Error('Project cannot be set to null');
-      } else {
+      if (args.projectName === null) {} else {
         projectFromInput = await db.Project.findOne({ where: { name: input.projectName } });
         if (!projectFromInput) throw new Error('Project not found');
killedBy: tasks_updateTaskMutation updateTaskProjectCannotBeNull
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
graphql/mutations/updateTaskMutation.js:34:25
     let projectFromInput = null;
     if (Object.prototype.hasOwnProperty.call(input, 'projectName')) {
       if (args.projectName === null) {
-        throw new Error('Project cannot be set to null');
+        throw new Error("");
       } else {
         projectFromInput = await db.Project.findOne({ where: { name: input.projectName } });
killedBy: tasks_updateTaskMutation updateTaskProjectCannotBeNull
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Project cannot be set to null"
Received: ""

[Killed] BlockStatement
graphql/mutations/updateTaskMutation.js:35:14
     if (Object.prototype.hasOwnProperty.call(input, 'projectName')) {
       if (args.projectName === null) {
         throw new Error('Project cannot be set to null');
-      } else {
-        projectFromInput = await db.Project.findOne({ where: { name: input.projectName } });
-        if (!projectFromInput) throw new Error('Project not found');
-        updateTask.projectID = projectFromInput.projectID;
-      }
+      } else {}
     }
 
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ObjectLiteral
graphql/mutations/updateTaskMutation.js:36:53
       if (args.projectName === null) {
         throw new Error('Project cannot be set to null');
       } else {
-        projectFromInput = await db.Project.findOne({ where: { name: input.projectName } });
+        projectFromInput = await db.Project.findOne({});
         if (!projectFromInput) throw new Error('Project not found');
         updateTask.projectID = projectFromInput.projectID;
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:37:13
         throw new Error('Project cannot be set to null');
       } else {
         projectFromInput = await db.Project.findOne({ where: { name: input.projectName } });
-        if (!projectFromInput) throw new Error('Project not found');
+        if (true) throw new Error('Project not found');
         updateTask.projectID = projectFromInput.projectID;
       }
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project not found]]

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:37:13
         throw new Error('Project cannot be set to null');
       } else {
         projectFromInput = await db.Project.findOne({ where: { name: input.projectName } });
-        if (!projectFromInput) throw new Error('Project not found');
+        if (false) throw new Error('Project not found');
         updateTask.projectID = projectFromInput.projectID;
       }
killedBy: tasks_updateTaskMutation updateTaskProjectNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Project not found"
Received: "Cannot read properties of null (reading 'projectID')"

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:42:9
       }
     }
 
-    if (Object.prototype.hasOwnProperty.call(input, SPRINT_NUMBER)) {
+    if (true) {
       if (args.sprintNumber === null) {
         updateTask.sprintID = null;
killedBy: tasks_updateTaskMutation updateTaskInvalidName
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Task name is required"
Received: "Invalid sprintNumber"

[Killed] BlockStatement
graphql/mutations/updateTaskMutation.js:42:69
       }
     }
 
-    if (Object.prototype.hasOwnProperty.call(input, SPRINT_NUMBER)) {
-      if (args.sprintNumber === null) {
-        updateTask.sprintID = null;
-      } else if (typeof args.sprintNumber === 'number') {
-        const sprintWhere = { number: args.sprintNumber };
-        sprintWhere.projectID = projectFromInput ? projectFromInput.projectID : task.projectID;
-        const sprint = await db.Sprint.findOne({ where: sprintWhere });
-        if (!sprint) throw new Error('Sprint not found');
-        updateTask.sprintID = sprint.sprintID;
-      } else {
-        throw new Error('Invalid sprintNumber');
-      }
-    }
+    if (Object.prototype.hasOwnProperty.call(input, SPRINT_NUMBER)) {}
 
     if (typeof args.name === 'string') {
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'sprintID')

[Killed] EqualityOperator
graphql/mutations/updateTaskMutation.js:43:11
     }
 
     if (Object.prototype.hasOwnProperty.call(input, SPRINT_NUMBER)) {
-      if (args.sprintNumber === null) {
+      if (args.sprintNumber !== null) {
         updateTask.sprintID = null;
       } else if (typeof args.sprintNumber === 'number') {
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: TypeError: Cannot read properties of null (reading 'sprintID')

[Killed] BlockStatement
graphql/mutations/updateTaskMutation.js:43:39
     }
 
     if (Object.prototype.hasOwnProperty.call(input, SPRINT_NUMBER)) {
-      if (args.sprintNumber === null) {
-        updateTask.sprintID = null;
-      } else if (typeof args.sprintNumber === 'number') {
+      if (args.sprintNumber === null) {} else if (typeof args.sprintNumber === 'number') {
         const sprintWhere = { number: args.sprintNumber };
         sprintWhere.projectID = projectFromInput ? projectFromInput.projectID : task.projectID;
killedBy: tasks_updateTaskMutation updateTaskNullSprint
statusReason: Error: expect(received).toBeNull()

Received: {"sprintID": 1, "sprintNumber": 1}

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:45:18
     if (Object.prototype.hasOwnProperty.call(input, SPRINT_NUMBER)) {
       if (args.sprintNumber === null) {
         updateTask.sprintID = null;
-      } else if (typeof args.sprintNumber === 'number') {
+      } else if (true) {
         const sprintWhere = { number: args.sprintNumber };
         sprintWhere.projectID = projectFromInput ? projectFromInput.projectID : task.projectID;
killedBy: tasks_updateTaskMutation updateTaskSprintNumberNonNumeric
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Invalid sprintNumber"
Received message:   "Sprint not found"

      154 |                 where: sprintWhere
      155 |               }));
    > 156 |               if (stryMutAct_9fa48("972") ? false : stryMutAct_9fa48("971") ? true : stryMutAct_9fa48("970") ? sprint : (stryCov_9fa48("970", "971", "972"), !sprint)) throw new

[Killed] EqualityOperator
graphql/mutations/updateTaskMutation.js:45:18
     if (Object.prototype.hasOwnProperty.call(input, SPRINT_NUMBER)) {
       if (args.sprintNumber === null) {
         updateTask.sprintID = null;
-      } else if (typeof args.sprintNumber === 'number') {
+      } else if (typeof args.sprintNumber !== 'number') {
         const sprintWhere = { number: args.sprintNumber };
         sprintWhere.projectID = projectFromInput ? projectFromInput.projectID : task.projectID;
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Invalid sprintNumber]]

[Killed] BlockStatement
graphql/mutations/updateTaskMutation.js:51:14
         const sprint = await db.Sprint.findOne({ where: sprintWhere });
         if (!sprint) throw new Error('Sprint not found');
         updateTask.sprintID = sprint.sprintID;
-      } else {
-        throw new Error('Invalid sprintNumber');
-      }
+      } else {}
     }
 
killedBy: tasks_updateTaskMutation updateTaskSprintNumberNonNumeric
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Killed] BlockStatement
graphql/mutations/updateTaskMutation.js:56:40
       }
     }
 
-    if (typeof args.name === 'string') {
-      const trimmedName = args.name.trim();
-      if (trimmedName === '') throw new Error('Task name is required');
-      if (trimmedName.length > 200) throw new Error('Task name must be at most 200 characters');
-      updateTask.name = trimmedName;
-    }
+    if (typeof args.name === 'string') {}
 
     if (typeof args.description === 'string') {
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New name"
Received: "Task name"

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:58:11
 
     if (typeof args.name === 'string') {
       const trimmedName = args.name.trim();
-      if (trimmedName === '') throw new Error('Task name is required');
+      if (true) throw new Error('Task name is required');
       if (trimmedName.length > 200) throw new Error('Task name must be at most 200 characters');
       updateTask.name = trimmedName;
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Task name is required]]

[Killed] EqualityOperator
graphql/mutations/updateTaskMutation.js:58:11
 
     if (typeof args.name === 'string') {
       const trimmedName = args.name.trim();
-      if (trimmedName === '') throw new Error('Task name is required');
+      if (trimmedName !== '') throw new Error('Task name is required');
       if (trimmedName.length > 200) throw new Error('Task name must be at most 200 characters');
       updateTask.name = trimmedName;
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Task name is required]]

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:59:11
     if (typeof args.name === 'string') {
       const trimmedName = args.name.trim();
       if (trimmedName === '') throw new Error('Task name is required');
-      if (trimmedName.length > 200) throw new Error('Task name must be at most 200 characters');
+      if (false) throw new Error('Task name must be at most 200 characters');
       updateTask.name = trimmedName;
     }
killedBy: tasks_updateTaskMutation updateTaskNameTooLong
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Task name must be at most 200 characters"
Received: "Validation error: Validation len on name failed"

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:59:11
     if (typeof args.name === 'string') {
       const trimmedName = args.name.trim();
       if (trimmedName === '') throw new Error('Task name is required');
-      if (trimmedName.length > 200) throw new Error('Task name must be at most 200 characters');
+      if (true) throw new Error('Task name must be at most 200 characters');
       updateTask.name = trimmedName;
     }
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Task name must be at most 200 characters]]

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:63:9
       updateTask.name = trimmedName;
     }
 
-    if (typeof args.description === 'string') {
+    if (false) {
       const trimmedDescription = args.description.trim();
       if (trimmedDescription === '') throw new Error('Task description is required');
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Description"
Received: "Task description"

[Killed] BlockStatement
graphql/mutations/updateTaskMutation.js:63:47
       updateTask.name = trimmedName;
     }
 
-    if (typeof args.description === 'string') {
-      const trimmedDescription = args.description.trim();
-      if (trimmedDescription === '') throw new Error('Task description is required');
-      if (trimmedDescription.length > 2000) throw new Error('Task description must be at most 2000 characters');
-      updateTask.description = trimmedDescription;
-    }
+    if (typeof args.description === 'string') {}
 
     if (typeof args.status === 'string') {
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Description"
Received: "Task description"

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:65:11
 
     if (typeof args.description === 'string') {
       const trimmedDescription = args.description.trim();
-      if (trimmedDescription === '') throw new Error('Task description is required');
+      if (true) throw new Error('Task description is required');
       if (trimmedDescription.length > 2000) throw new Error('Task description must be at most 2000 characters');
       updateTask.description = trimmedDescription;
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Task description is required]]

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:65:11
 
     if (typeof args.description === 'string') {
       const trimmedDescription = args.description.trim();
-      if (trimmedDescription === '') throw new Error('Task description is required');
+      if (false) throw new Error('Task description is required');
       if (trimmedDescription.length > 2000) throw new Error('Task description must be at most 2000 characters');
       updateTask.description = trimmedDescription;
killedBy: tasks_updateTaskMutation updateTaskEmptyTrimmedDescription
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Task description is required"
Received message:   "Validation error: Validation notEmpty on description failed,
Validation error: Validation len on description failed"

      199 |         }
      200 |       }

[Killed] EqualityOperator
graphql/mutations/updateTaskMutation.js:66:11
     if (typeof args.description === 'string') {
       const trimmedDescription = args.description.trim();
       if (trimmedDescription === '') throw new Error('Task description is required');
-      if (trimmedDescription.length > 2000) throw new Error('Task description must be at most 2000 characters');
+      if (trimmedDescription.length >= 2000) throw new Error('Task description must be at most 2000 characters');
       updateTask.description = trimmedDescription;
     }
killedBy: tasks_updateTaskMutation updateTaskDescriptionMaxLength
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Task description must be at most 2000 characters]]

[Killed] EqualityOperator
graphql/mutations/updateTaskMutation.js:66:11
     if (typeof args.description === 'string') {
       const trimmedDescription = args.description.trim();
       if (trimmedDescription === '') throw new Error('Task description is required');
-      if (trimmedDescription.length > 2000) throw new Error('Task description must be at most 2000 characters');
+      if (trimmedDescription.length <= 2000) throw new Error('Task description must be at most 2000 characters');
       updateTask.description = trimmedDescription;
     }
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Task description must be at most 2000 characters]]

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:70:9
       updateTask.description = trimmedDescription;
     }
 
-    if (typeof args.status === 'string') {
+    if (true) {
       const allowedStatuses = ['Open', 'In Progress', 'Done', 'Closed'];
       if (!allowedStatuses.includes(args.status)) throw new Error('Invalid status');
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: Invalid status

[Killed] EqualityOperator
graphql/mutations/updateTaskMutation.js:70:9
       updateTask.description = trimmedDescription;
     }
 
-    if (typeof args.status === 'string') {
+    if (typeof args.status !== 'string') {
       const allowedStatuses = ['Open', 'In Progress', 'Done', 'Closed'];
       if (!allowedStatuses.includes(args.status)) throw new Error('Invalid status');
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "In Progress"
Received: "Open"

[Killed] StringLiteral
graphql/mutations/updateTaskMutation.js:71:32
     }
 
     if (typeof args.status === 'string') {
-      const allowedStatuses = ['Open', 'In Progress', 'Done', 'Closed'];
+      const allowedStatuses = ["", 'In Progress', 'Done', 'Closed'];
       if (!allowedStatuses.includes(args.status)) throw new Error('Invalid status');
       updateTask.status = args.status;
killedBy: tasks_updateTaskMutation updateTaskAllowedStatuses
statusReason: Error: Invalid status

[Killed] ConditionalExpression
graphql/mutations/updateTaskMutation.js:72:11
 
     if (typeof args.status === 'string') {
       const allowedStatuses = ['Open', 'In Progress', 'Done', 'Closed'];
-      if (!allowedStatuses.includes(args.status)) throw new Error('Invalid status');
+      if (true) throw new Error('Invalid status');
       updateTask.status = args.status;
     }
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Invalid status]]

[Killed] BooleanLiteral
graphql/mutations/updateTaskMutation.js:72:11
 
     if (typeof args.status === 'string') {
       const allowedStatuses = ['Open', 'In Progress', 'Done', 'Closed'];
-      if (!allowedStatuses.includes(args.status)) throw new Error('Invalid status');
+      if (allowedStatuses.includes(args.status)) throw new Error('Invalid status');
       updateTask.status = args.status;
     }
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Invalid status]]

[Killed] StringLiteral
graphql/mutations/updateTaskMutation.js:80:34
 
     return db.Task.findByPk(task.taskID, {
       include: [
-        { model: db.Project, as: 'project' },
+        { model: db.Project, as: "" },
         { model: db.Sprint, as: 'sprint' },
         { model: db.User, as: 'reporter' },
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project is associated to Task using an alias. You must use the 'as' keyword to specify the alias within your include statement.]]

[Killed] ObjectLiteral
graphql/mutations/updateTaskMutation.js:81:9
     return db.Task.findByPk(task.taskID, {
       include: [
         { model: db.Project, as: 'project' },
-        { model: db.Sprint, as: 'sprint' },
+        {},
         { model: db.User, as: 'reporter' },
         { model: db.User, as: 'assignee' },
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Include unexpected. Element has to be either a Model, an Association or an object.]]

[Killed] StringLiteral
graphql/mutations/updateTaskMutation.js:81:33
     return db.Task.findByPk(task.taskID, {
       include: [
         { model: db.Project, as: 'project' },
-        { model: db.Sprint, as: 'sprint' },
+        { model: db.Sprint, as: "" },
         { model: db.User, as: 'reporter' },
         { model: db.User, as: 'assignee' },
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Sprint is associated to Task using an alias. You must use the 'as' keyword to specify the alias within your include statement.]]

[Killed] ObjectLiteral
graphql/mutations/updateTaskMutation.js:82:9
       include: [
         { model: db.Project, as: 'project' },
         { model: db.Sprint, as: 'sprint' },
-        { model: db.User, as: 'reporter' },
+        {},
         { model: db.User, as: 'assignee' },
       ],
killedBy: tasks_updateTaskMutation updateTaskAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Include unexpected. Element has to be either a Model, an Association or an object.]]
