[Killed] BlockStatement
graphql/mutations/addRoleToUserMutation.js:12:64
     username: { type: new GraphQLNonNull(GraphQLString) },
     roleName: { type: new GraphQLNonNull(GraphQLString) },
   },
-  resolve: async (_source, { username, roleName }, context) => {
-    // only Admins can perform this action
-    authorizeRoles(context, ['Admin']);
-
-    const user = await db.User.findOne({ where: { username } });
-    if (!user) throw new Error('User not found');
-
-    const role = await db.Role.findOne({ where: { name: roleName } });
-    if (!role) throw new Error('Role not found');
-
-    // check if user already has role
-    const existing = await db.UserRole.findOne({ where: { userID: user.userID, roleID: role.roleID } });
-    if (existing) throw new Error('User already has this role');
-
-    await db.UserRole.create({ userID: user.userID, roleID: role.roleID });
-
-    const userWithRoles = await db.User.findByPk(user.userID, { include: [{ model: db.Role, as: 'roles' }] });
-    return userWithRoles;
-  },
+  resolve: async (_source, { username, roleName }, context) => {},
 };
 
killedBy: users_addRoleToUserMutation roleAssignmentAllValid
statusReason: TypeError: Cannot read properties of null (reading 'roles')

[Killed] ArrayDeclaration
graphql/mutations/addRoleToUserMutation.js:14:29
   },
   resolve: async (_source, { username, roleName }, context) => {
     // only Admins can perform this action
-    authorizeRoles(context, ['Admin']);
+    authorizeRoles(context, []);
 
     const user = await db.User.findOne({ where: { username } });
killedBy: users_addRoleToUserMutation roleAssignmentAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Not authorized]]

[Killed] ConditionalExpression
graphql/mutations/addRoleToUserMutation.js:17:9
     authorizeRoles(context, ['Admin']);
 
     const user = await db.User.findOne({ where: { username } });
-    if (!user) throw new Error('User not found');
+    if (false) throw new Error('User not found');
 
     const role = await db.Role.findOne({ where: { name: roleName } });
killedBy: users_addRoleToUserMutation roleAssignmentUserNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: "Cannot read properties of null (reading 'userID')"

[Killed] BooleanLiteral
graphql/mutations/addRoleToUserMutation.js:17:9
     authorizeRoles(context, ['Admin']);
 
     const user = await db.User.findOne({ where: { username } });
-    if (!user) throw new Error('User not found');
+    if (user) throw new Error('User not found');
 
     const role = await db.Role.findOne({ where: { name: roleName } });
killedBy: users_addRoleToUserMutation roleAssignmentAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: User not found]]

[Killed] ObjectLiteral
graphql/mutations/addRoleToUserMutation.js:19:40
     const user = await db.User.findOne({ where: { username } });
     if (!user) throw new Error('User not found');
 
-    const role = await db.Role.findOne({ where: { name: roleName } });
+    const role = await db.Role.findOne({});
     if (!role) throw new Error('Role not found');
 
killedBy: users_addRoleToUserMutation roleAssignmentAllValid
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Manager"
Received array: ["Admin"]

[Killed] ConditionalExpression
graphql/mutations/addRoleToUserMutation.js:20:9
     if (!user) throw new Error('User not found');
 
     const role = await db.Role.findOne({ where: { name: roleName } });
-    if (!role) throw new Error('Role not found');
+    if (true) throw new Error('Role not found');
 
     // check if user already has role
killedBy: users_addRoleToUserMutation roleAssignmentAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Role not found]]

[Killed] BooleanLiteral
graphql/mutations/addRoleToUserMutation.js:20:9
     if (!user) throw new Error('User not found');
 
     const role = await db.Role.findOne({ where: { name: roleName } });
-    if (!role) throw new Error('Role not found');
+    if (role) throw new Error('Role not found');
 
     // check if user already has role
killedBy: users_addRoleToUserMutation roleAssignmentAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Role not found]]

[Killed] ObjectLiteral
graphql/mutations/addRoleToUserMutation.js:23:57
     if (!role) throw new Error('Role not found');
 
     // check if user already has role
-    const existing = await db.UserRole.findOne({ where: { userID: user.userID, roleID: role.roleID } });
+    const existing = await db.UserRole.findOne({ where: {} });
     if (existing) throw new Error('User already has this role');
 
killedBy: users_addRoleToUserMutation roleAssignmentAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: User already has this role]]

[Killed] ConditionalExpression
graphql/mutations/addRoleToUserMutation.js:24:9
 
     // check if user already has role
     const existing = await db.UserRole.findOne({ where: { userID: user.userID, roleID: role.roleID } });
-    if (existing) throw new Error('User already has this role');
+    if (false) throw new Error('User already has this role');
 
     await db.UserRole.create({ userID: user.userID, roleID: role.roleID });
killedBy: users_addRoleToUserMutation roleAssignmentRoleAlreadyAssigned
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User already has this role"
Received: "Validation error"

[Killed] ConditionalExpression
graphql/mutations/addRoleToUserMutation.js:24:9
 
     // check if user already has role
     const existing = await db.UserRole.findOne({ where: { userID: user.userID, roleID: role.roleID } });
-    if (existing) throw new Error('User already has this role');
+    if (true) throw new Error('User already has this role');
 
     await db.UserRole.create({ userID: user.userID, roleID: role.roleID });
killedBy: users_addRoleToUserMutation roleAssignmentAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: User already has this role]]

[Killed] ArrayDeclaration
graphql/mutations/addRoleToUserMutation.js:28:74
 
     await db.UserRole.create({ userID: user.userID, roleID: role.roleID });
 
-    const userWithRoles = await db.User.findByPk(user.userID, { include: [{ model: db.Role, as: 'roles' }] });
+    const userWithRoles = await db.User.findByPk(user.userID, { include: [] });
     return userWithRoles;
   },
killedBy: users_addRoleToUserMutation roleAssignmentAllValid
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Manager"
Received array: []

[Killed] ObjectLiteral
graphql/mutations/addRoleToUserMutation.js:28:75
 
     await db.UserRole.create({ userID: user.userID, roleID: role.roleID });
 
-    const userWithRoles = await db.User.findByPk(user.userID, { include: [{ model: db.Role, as: 'roles' }] });
+    const userWithRoles = await db.User.findByPk(user.userID, { include: [{}] });
     return userWithRoles;
   },
killedBy: users_addRoleToUserMutation roleAssignmentAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Include unexpected. Element has to be either a Model, an Association or an object.]]
