[Killed] BlockStatement
graphql/mutations/addUserToProjectMutation.js:11:46
   args: {
     input: { type: new GraphQLNonNull(AddUserToProjectInputType) },
   },
-  resolve: async (_source, args, context) => {
-    const input = args.input || args;
-    const { projectID, userID } = input;
-    authorizeRoles(context, ['Admin', 'Manager']);
-
-    const project = await db.Project.findByPk(projectID);
-    if (!project) throw new Error('Project not found');
-
-    const user = await db.User.findByPk(userID);
-    if (!user) throw new Error('User not found');
-
-    const existingEntry = await db.UserProject.findOne({
-      where: { projectID, userID }
-    });
-
-    if (existingEntry) {
-      throw new Error('User is already assigned to this project');
-    }
-
-    await db.UserProject.create({ projectID, userID });
-
-    return true;
-  },
+  resolve: async (_source, args, context) => {},
 };
killedBy: projects_addUserToProjectMutation addUserToProjectAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: null

[Killed] ConditionalExpression
graphql/mutations/addUserToProjectMutation.js:12:19
     input: { type: new GraphQLNonNull(AddUserToProjectInputType) },
   },
   resolve: async (_source, args, context) => {
-    const input = args.input || args;
+    const input = false;
     const { projectID, userID } = input;
     authorizeRoles(context, ['Admin', 'Manager']);
killedBy: projects_addUserToProjectMutation addUserToProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project not found]]

[Killed] ConditionalExpression
graphql/mutations/addUserToProjectMutation.js:12:19
     input: { type: new GraphQLNonNull(AddUserToProjectInputType) },
   },
   resolve: async (_source, args, context) => {
-    const input = args.input || args;
+    const input = true;
     const { projectID, userID } = input;
     authorizeRoles(context, ['Admin', 'Manager']);
killedBy: projects_addUserToProjectMutation addUserToProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project not found]]

[Killed] StringLiteral
graphql/mutations/addUserToProjectMutation.js:14:39
   resolve: async (_source, args, context) => {
     const input = args.input || args;
     const { projectID, userID } = input;
-    authorizeRoles(context, ['Admin', 'Manager']);
+    authorizeRoles(context, ['Admin', ""]);
 
     const project = await db.Project.findByPk(projectID);
killedBy: projects_addUserToProjectMutation addUserToProjectManagerAllowed
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Not authorized]]

[Killed] ConditionalExpression
graphql/mutations/addUserToProjectMutation.js:17:9
     authorizeRoles(context, ['Admin', 'Manager']);
 
     const project = await db.Project.findByPk(projectID);
-    if (!project) throw new Error('Project not found');
+    if (false) throw new Error('Project not found');
 
     const user = await db.User.findByPk(userID);
killedBy: projects_addUserToProjectMutation addUserToProjectProjectNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Project not found"
Received: "SQLITE_CONSTRAINT: FOREIGN KEY constraint failed"

[Killed] BooleanLiteral
graphql/mutations/addUserToProjectMutation.js:17:9
     authorizeRoles(context, ['Admin', 'Manager']);
 
     const project = await db.Project.findByPk(projectID);
-    if (!project) throw new Error('Project not found');
+    if (project) throw new Error('Project not found');
 
     const user = await db.User.findByPk(userID);
killedBy: projects_addUserToProjectMutation addUserToProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project not found]]

[Killed] BooleanLiteral
graphql/mutations/addUserToProjectMutation.js:20:9
     if (!project) throw new Error('Project not found');
 
     const user = await db.User.findByPk(userID);
-    if (!user) throw new Error('User not found');
+    if (user) throw new Error('User not found');
 
     const existingEntry = await db.UserProject.findOne({
killedBy: projects_addUserToProjectMutation addUserToProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: User not found]]

[Killed] ConditionalExpression
graphql/mutations/addUserToProjectMutation.js:20:9
     if (!project) throw new Error('Project not found');
 
     const user = await db.User.findByPk(userID);
-    if (!user) throw new Error('User not found');
+    if (true) throw new Error('User not found');
 
     const existingEntry = await db.UserProject.findOne({
killedBy: projects_addUserToProjectMutation addUserToProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: User not found]]

[Killed] ObjectLiteral
graphql/mutations/addUserToProjectMutation.js:23:14
     if (!user) throw new Error('User not found');
 
     const existingEntry = await db.UserProject.findOne({
-      where: { projectID, userID }
+      where: {}
     });
 
killedBy: projects_addUserToProjectMutation addUserToProjectIgnoresOtherLinks
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: User is already assigned to this project]]

[Killed] BlockStatement
graphql/mutations/addUserToProjectMutation.js:26:24
       where: { projectID, userID }
     });
 
-    if (existingEntry) {
-      throw new Error('User is already assigned to this project');
-    }
+    if (existingEntry) {}
 
     await db.UserProject.create({ projectID, userID });
killedBy: projects_addUserToProjectMutation addUserToProjectAlreadyAssigned
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User is already assigned to this project"
Received: "Validation error"

[Killed] ConditionalExpression
graphql/mutations/addUserToProjectMutation.js:26:9
       where: { projectID, userID }
     });
 
-    if (existingEntry) {
+    if (false) {
       throw new Error('User is already assigned to this project');
     }
killedBy: projects_addUserToProjectMutation addUserToProjectAlreadyAssigned
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User is already assigned to this project"
Received: "Validation error"

[Killed] ObjectLiteral
graphql/mutations/addUserToProjectMutation.js:30:33
       throw new Error('User is already assigned to this project');
     }
 
-    await db.UserProject.create({ projectID, userID });
+    await db.UserProject.create({});
 
     return true;
killedBy: projects_addUserToProjectMutation addUserToProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: notNull Violation: UserProject.userID cannot be null,
notNull Violation: UserProject.projectID cannot be null]]
