[Killed] LogicalOperator
graphql/mutations/createProjectMutation.js:18:21
   },
   resolve: async (_source, args, context) => {
     const input = args.input || args;
-    const rawName = input.name || '';
+    const rawName = input.name && '';
     const name = rawName.trim();
     const description = typeof input.description === 'string' ? input.description.trim() : null;
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project name is required]]

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:18:21
   },
   resolve: async (_source, args, context) => {
     const input = args.input || args;
-    const rawName = input.name || '';
+    const rawName = false;
     const name = rawName.trim();
     const description = typeof input.description === 'string' ? input.description.trim() : null;
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: rawName.trim is not a function]]

[Killed] MethodExpression
graphql/mutations/createProjectMutation.js:19:18
   resolve: async (_source, args, context) => {
     const input = args.input || args;
     const rawName = input.name || '';
-    const name = rawName.trim();
+    const name = rawName;
     const description = typeof input.description === 'string' ? input.description.trim() : null;
     const { repositoryID } = input;
killedBy: projects_createProjectMutation createProjectTrimmedName
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "JavascriptTesting"
Received: "  JavascriptTesting  "

[Killed] MethodExpression
graphql/mutations/createProjectMutation.js:20:65
     const input = args.input || args;
     const rawName = input.name || '';
     const name = rawName.trim();
-    const description = typeof input.description === 'string' ? input.description.trim() : null;
+    const description = typeof input.description === 'string' ? input.description : null;
     const { repositoryID } = input;
     authorizeRoles(context, ['Admin', 'Manager']);
killedBy: projects_createProjectMutation createProjectTrimmedDescription
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Short description"
Received: "  Short description  "

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:20:25
     const input = args.input || args;
     const rawName = input.name || '';
     const name = rawName.trim();
-    const description = typeof input.description === 'string' ? input.description.trim() : null;
+    const description = true ? input.description.trim() : null;
     const { repositoryID } = input;
     authorizeRoles(context, ['Admin', 'Manager']);
killedBy: projects_createProjectMutation createProjectAllValidNoDescription
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Cannot read properties of undefined (reading 'trim')]]

[Killed] StringLiteral
graphql/mutations/createProjectMutation.js:22:30
     const name = rawName.trim();
     const description = typeof input.description === 'string' ? input.description.trim() : null;
     const { repositoryID } = input;
-    authorizeRoles(context, ['Admin', 'Manager']);
+    authorizeRoles(context, ["", 'Manager']);
 
     if (!name) throw new Error('Project name is required');
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Not authorized]]

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:24:9
     const { repositoryID } = input;
     authorizeRoles(context, ['Admin', 'Manager']);
 
-    if (!name) throw new Error('Project name is required');
+    if (true) throw new Error('Project name is required');
     if (name.length < projectNameMinLength || name.length > projectNameMaxLength) {
       throw new Error('Project name must be between 3 and 50 characters');
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project name is required]]

[Killed] BooleanLiteral
graphql/mutations/createProjectMutation.js:24:9
     const { repositoryID } = input;
     authorizeRoles(context, ['Admin', 'Manager']);
 
-    if (!name) throw new Error('Project name is required');
+    if (name) throw new Error('Project name is required');
     if (name.length < projectNameMinLength || name.length > projectNameMaxLength) {
       throw new Error('Project name must be between 3 and 50 characters');
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project name is required]]

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:25:9
     authorizeRoles(context, ['Admin', 'Manager']);
 
     if (!name) throw new Error('Project name is required');
-    if (name.length < projectNameMinLength || name.length > projectNameMaxLength) {
+    if (false) {
       throw new Error('Project name must be between 3 and 50 characters');
     }
killedBy: projects_createProjectMutation createProjectNameTooShort
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:25:9
     authorizeRoles(context, ['Admin', 'Manager']);
 
     if (!name) throw new Error('Project name is required');
-    if (name.length < projectNameMinLength || name.length > projectNameMaxLength) {
+    if (false || name.length > projectNameMaxLength) {
       throw new Error('Project name must be between 3 and 50 characters');
     }
killedBy: projects_createProjectMutation createProjectNameTooShort
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:28:24
     if (name.length < projectNameMinLength || name.length > projectNameMaxLength) {
       throw new Error('Project name must be between 3 and 50 characters');
     }
-    if (description && description.length > descriptionMaxLength) {
+    if (description && true) {
       throw new Error('Description must be at most 500 characters');
     }
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Description must be at most 500 characters]]

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:28:9
     if (name.length < projectNameMinLength || name.length > projectNameMaxLength) {
       throw new Error('Project name must be between 3 and 50 characters');
     }
-    if (description && description.length > descriptionMaxLength) {
+    if (true) {
       throw new Error('Description must be at most 500 characters');
     }
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Description must be at most 500 characters]]

[Killed] ObjectLiteral
graphql/mutations/createProjectMutation.js:32:63
       throw new Error('Description must be at most 500 characters');
     }
 
-    const existingProject = await db.Project.findOne({ where: { name } });
+    const existingProject = await db.Project.findOne({ where: {} });
     if (existingProject) {
       throw new Error('A project with this name already exists');
killedBy: projects_createProjectMutation createProjectRepositoryAssigned
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "This repository is already assigned to another project"
Received: "A project with this name already exists"

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:33:9
     }
 
     const existingProject = await db.Project.findOne({ where: { name } });
-    if (existingProject) {
+    if (false) {
       throw new Error('A project with this name already exists');
     }
killedBy: projects_createProjectMutation createProjectNameDuplicate
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:33:9
     }
 
     const existingProject = await db.Project.findOne({ where: { name } });
-    if (existingProject) {
+    if (true) {
       throw new Error('A project with this name already exists');
     }
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: A project with this name already exists]]

[Killed] StringLiteral
graphql/mutations/createProjectMutation.js:34:23
 
     const existingProject = await db.Project.findOne({ where: { name } });
     if (existingProject) {
-      throw new Error('A project with this name already exists');
+      throw new Error("");
     }
 
killedBy: projects_createProjectMutation createProjectNameDuplicate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A project with this name already exists"
Received: ""

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:37:9
       throw new Error('A project with this name already exists');
     }
 
-    if (repositoryID) {
+    if (false) {
       const repo = await db.Repository.findByPk(repositoryID);
       if (!repo) {
killedBy: projects_createProjectMutation createProjectRepositoryNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Repository ID not found"
Received: "SQLITE_CONSTRAINT: FOREIGN KEY constraint failed"

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:37:9
       throw new Error('A project with this name already exists');
     }
 
-    if (repositoryID) {
+    if (true) {
       const repo = await db.Repository.findByPk(repositoryID);
       if (!repo) {
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Repository ID not found]]

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:39:11
 
     if (repositoryID) {
       const repo = await db.Repository.findByPk(repositoryID);
-      if (!repo) {
+      if (true) {
         throw new Error('Repository ID not found');
       }
killedBy: projects_createProjectMutation createProjectRepositoryAssigned
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "This repository is already assigned to another project"
Received: "Repository ID not found"

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:39:11
 
     if (repositoryID) {
       const repo = await db.Repository.findByPk(repositoryID);
-      if (!repo) {
+      if (false) {
         throw new Error('Repository ID not found');
       }
killedBy: projects_createProjectMutation createProjectRepositoryNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Repository ID not found"
Received: "SQLITE_CONSTRAINT: FOREIGN KEY constraint failed"

[Killed] ObjectLiteral
graphql/mutations/createProjectMutation.js:42:60
       if (!repo) {
         throw new Error('Repository ID not found');
       }
-      const isAssigned = await db.Project.findOne({ where: { repositoryID } });
+      const isAssigned = await db.Project.findOne({ where: {} });
       if (isAssigned) {
         throw new Error('This repository is already assigned to another project');
killedBy: projects_createProjectMutation createProjectRepositoryValidWithExistingProject
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: This repository is already assigned to another project]]

[Killed] BlockStatement
graphql/mutations/createProjectMutation.js:43:23
         throw new Error('Repository ID not found');
       }
       const isAssigned = await db.Project.findOne({ where: { repositoryID } });
-      if (isAssigned) {
-        throw new Error('This repository is already assigned to another project');
-      }
+      if (isAssigned) {}
     }
 
killedBy: projects_createProjectMutation createProjectRepositoryAssigned
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "This repository is already assigned to another project"
Received: "Validation error"

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:43:11
         throw new Error('Repository ID not found');
       }
       const isAssigned = await db.Project.findOne({ where: { repositoryID } });
-      if (isAssigned) {
+      if (true) {
         throw new Error('This repository is already assigned to another project');
       }
killedBy: projects_createProjectMutation createProjectRepositoryValidWithExistingProject
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: This repository is already assigned to another project]]

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:50:20
 
     const newProject = await db.Project.create({
       name,
-      description: description || null,
+      description: true,
       repositoryID: repositoryID || null,
     });
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Short description"
Received: "1"

[Killed] LogicalOperator
graphql/mutations/createProjectMutation.js:50:20
 
     const newProject = await db.Project.create({
       name,
-      description: description || null,
+      description: description && null,
       repositoryID: repositoryID || null,
     });
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Short description"
Received: null

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:51:21
     const newProject = await db.Project.create({
       name,
       description: description || null,
-      repositoryID: repositoryID || null,
+      repositoryID: false,
     });
 
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: SQLITE_CONSTRAINT: FOREIGN KEY constraint failed]]

[Killed] ConditionalExpression
graphql/mutations/createProjectMutation.js:51:21
     const newProject = await db.Project.create({
       name,
       description: description || null,
-      repositoryID: repositoryID || null,
+      repositoryID: true,
     });
 
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: SQLITE_CONSTRAINT: FOREIGN KEY constraint failed]]

[Killed] StringLiteral
graphql/mutations/createProjectMutation.js:55:47
     });
 
     return db.Project.findByPk(newProject.projectID, {
-        include: [{ model: db.Repository, as: 'repository' }]
+        include: [{ model: db.Repository, as: "" }]
     });
   },
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Repository is associated to Project using an alias. You must use the 'as' keyword to specify the alias within your include statement.]]

[Killed] ObjectLiteral
graphql/mutations/createProjectMutation.js:55:19
     });
 
     return db.Project.findByPk(newProject.projectID, {
-        include: [{ model: db.Repository, as: 'repository' }]
+        include: [{}]
     });
   },
killedBy: projects_createProjectMutation createProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Include unexpected. Element has to be either a Model, an Association or an object.]]
