[Killed] BlockStatement
graphql/mutations/deleteProjectMutation.js:10:55
   args: {
     projectID: { type: new GraphQLNonNull(GraphQLInt) },
   },
-  resolve: async (_source, { projectID }, context) => {
-    authorizeRoles(context, ['Admin']);
-
-    const project = await db.Project.findByPk(projectID);
-    if (!project) throw new Error('Project not found');
-
-    await project.destroy();
-
-    return true;
-  },
+  resolve: async (_source, { projectID }, context) => {},
 };
killedBy: projects_deleteProjectMutation deleteProjectAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: null

[Killed] StringLiteral
graphql/mutations/deleteProjectMutation.js:11:30
     projectID: { type: new GraphQLNonNull(GraphQLInt) },
   },
   resolve: async (_source, { projectID }, context) => {
-    authorizeRoles(context, ['Admin']);
+    authorizeRoles(context, [""]);
 
     const project = await db.Project.findByPk(projectID);
killedBy: projects_deleteProjectMutation deleteProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Not authorized]]
