[Killed] ConditionalExpression
graphql/mutations/loginMutation.js:22:20
     input: { type: new GraphQLNonNull(LoginInputType) },
   },
   async resolve(_, { input }) {
-    const email = (input.email || '').trim();
+    const email = (false).trim();
     const password = input.password || '';
 
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).trim is not a function]]

[Killed] MethodExpression
graphql/mutations/loginMutation.js:22:19
     input: { type: new GraphQLNonNull(LoginInputType) },
   },
   async resolve(_, { input }) {
-    const email = (input.email || '').trim();
+    const email = input.email || '';
     const password = input.password || '';
 
killedBy: users_loginMutation loginEmailWithSpacesValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Email is invalid]]

[Killed] ConditionalExpression
graphql/mutations/loginMutation.js:23:22
   },
   async resolve(_, { input }) {
     const email = (input.email || '').trim();
-    const password = input.password || '';
+    const password = false;
 
     if (!email) throw new Error('Email is required');
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Password is required]]

[Killed] ConditionalExpression
graphql/mutations/loginMutation.js:23:22
   },
   async resolve(_, { input }) {
     const email = (input.email || '').trim();
-    const password = input.password || '';
+    const password = true;
 
     if (!email) throw new Error('Email is required');
killedBy: users_loginMutation loginPasswordMissing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Password is required"
Received: "Invalid credentials"

[Killed] BooleanLiteral
graphql/mutations/loginMutation.js:25:9
     const email = (input.email || '').trim();
     const password = input.password || '';
 
-    if (!email) throw new Error('Email is required');
+    if (email) throw new Error('Email is required');
     if (email.length < emailMinLength || email.length > emailMaxLength) {
       throw new Error('Email must be between 5 and 254 characters');
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Email is required]]

[Killed] ConditionalExpression
graphql/mutations/loginMutation.js:25:9
     const email = (input.email || '').trim();
     const password = input.password || '';
 
-    if (!email) throw new Error('Email is required');
+    if (true) throw new Error('Email is required');
     if (email.length < emailMinLength || email.length > emailMaxLength) {
       throw new Error('Email must be between 5 and 254 characters');
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Email is required]]

[Killed] EqualityOperator
graphql/mutations/loginMutation.js:26:42
     const password = input.password || '';
 
     if (!email) throw new Error('Email is required');
-    if (email.length < emailMinLength || email.length > emailMaxLength) {
+    if (email.length < emailMinLength || email.length <= emailMaxLength) {
       throw new Error('Email must be between 5 and 254 characters');
     }
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Email must be between 5 and 254 characters]]

[Killed] ConditionalExpression
graphql/mutations/loginMutation.js:26:9
     const password = input.password || '';
 
     if (!email) throw new Error('Email is required');
-    if (email.length < emailMinLength || email.length > emailMaxLength) {
+    if (true) {
       throw new Error('Email must be between 5 and 254 characters');
     }
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Email must be between 5 and 254 characters]]

[Killed] ConditionalExpression
graphql/mutations/loginMutation.js:29:9
     if (email.length < emailMinLength || email.length > emailMaxLength) {
       throw new Error('Email must be between 5 and 254 characters');
     }
-    if (!emailRegex.test(email)) throw new Error('Email is invalid');
+    if (false) throw new Error('Email is invalid');
 
     if (!password) throw new Error('Password is required');
killedBy: users_loginMutation loginEmailLeadingJunkInvalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Email is invalid"
Received: "Invalid credentials"

[Killed] BooleanLiteral
graphql/mutations/loginMutation.js:29:9
     if (email.length < emailMinLength || email.length > emailMaxLength) {
       throw new Error('Email must be between 5 and 254 characters');
     }
-    if (!emailRegex.test(email)) throw new Error('Email is invalid');
+    if (emailRegex.test(email)) throw new Error('Email is invalid');
 
     if (!password) throw new Error('Password is required');
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Email is invalid]]

[Killed] ConditionalExpression
graphql/mutations/loginMutation.js:31:9
     }
     if (!emailRegex.test(email)) throw new Error('Email is invalid');
 
-    if (!password) throw new Error('Password is required');
+    if (false) throw new Error('Password is required');
     if (password.length < passwordMinLength || password.length > passwordMaxLength) {
       throw new Error('Password must be between 8 and 64 characters');
killedBy: users_loginMutation loginPasswordMissing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Password is required"
Received: "Password must be between 8 and 64 characters"

[Killed] BooleanLiteral
graphql/mutations/loginMutation.js:31:9
     }
     if (!emailRegex.test(email)) throw new Error('Email is invalid');
 
-    if (!password) throw new Error('Password is required');
+    if (password) throw new Error('Password is required');
     if (password.length < passwordMinLength || password.length > passwordMaxLength) {
       throw new Error('Password must be between 8 and 64 characters');
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Password is required]]

[Killed] EqualityOperator
graphql/mutations/loginMutation.js:32:48
     if (!emailRegex.test(email)) throw new Error('Email is invalid');
 
     if (!password) throw new Error('Password is required');
-    if (password.length < passwordMinLength || password.length > passwordMaxLength) {
+    if (password.length < passwordMinLength || password.length >= passwordMaxLength) {
       throw new Error('Password must be between 8 and 64 characters');
     }
killedBy: users_loginMutation loginPasswordMaxLengthValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Password must be between 8 and 64 characters]]

[Killed] EqualityOperator
graphql/mutations/loginMutation.js:32:48
     if (!emailRegex.test(email)) throw new Error('Email is invalid');
 
     if (!password) throw new Error('Password is required');
-    if (password.length < passwordMinLength || password.length > passwordMaxLength) {
+    if (password.length < passwordMinLength || password.length <= passwordMaxLength) {
       throw new Error('Password must be between 8 and 64 characters');
     }
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Password must be between 8 and 64 characters]]

[Killed] StringLiteral
graphql/mutations/loginMutation.js:36:161
       throw new Error('Password must be between 8 and 64 characters');
     }
 
-    const user = await db.User.findOne({ where: { email }, include: [{ model: db.Role, as: 'roles' }, { model: db.Team, as: 'team' }, { model: db.Position, as: 'position' }] });
+    const user = await db.User.findOne({ where: { email }, include: [{ model: db.Role, as: 'roles' }, { model: db.Team, as: 'team' }, { model: db.Position, as: "" }] });
     if (!user) {
       throw new Error('Invalid credentials');
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Position is associated to User using an alias. You must use the 'as' keyword to specify the alias within your include statement.]]

[Killed] ObjectLiteral
graphql/mutations/loginMutation.js:36:70
       throw new Error('Password must be between 8 and 64 characters');
     }
 
-    const user = await db.User.findOne({ where: { email }, include: [{ model: db.Role, as: 'roles' }, { model: db.Team, as: 'team' }, { model: db.Position, as: 'position' }] });
+    const user = await db.User.findOne({ where: { email }, include: [{}, { model: db.Team, as: 'team' }, { model: db.Position, as: 'position' }] });
     if (!user) {
       throw new Error('Invalid credentials');
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Include unexpected. Element has to be either a Model, an Association or an object.]]

[Killed] BooleanLiteral
graphql/mutations/loginMutation.js:37:9
     }
 
     const user = await db.User.findOne({ where: { email }, include: [{ model: db.Role, as: 'roles' }, { model: db.Team, as: 'team' }, { model: db.Position, as: 'position' }] });
-    if (!user) {
+    if (user) {
       throw new Error('Invalid credentials');
     }
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Invalid credentials]]

[Killed] ConditionalExpression
graphql/mutations/loginMutation.js:37:9
     }
 
     const user = await db.User.findOne({ where: { email }, include: [{ model: db.Role, as: 'roles' }, { model: db.Team, as: 'team' }, { model: db.Position, as: 'position' }] });
-    if (!user) {
+    if (true) {
       throw new Error('Invalid credentials');
     }
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Invalid credentials]]

[Killed] BlockStatement
graphql/mutations/loginMutation.js:42:14
     }
 
     const ok = await bcrypt.compare(input.password, user.password);
-    if (!ok) {
-      throw new Error('Invalid credentials');
-    }
+    if (!ok) {}
 
     const roleNames = user.roles.map(r => r.name);
killedBy: users_loginMutation loginPasswordMismatch
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/loginMutation.js:42:9
     }
 
     const ok = await bcrypt.compare(input.password, user.password);
-    if (!ok) {
+    if (false) {
       throw new Error('Invalid credentials');
     }
killedBy: users_loginMutation loginPasswordMismatch
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
graphql/mutations/loginMutation.js:46:38
       throw new Error('Invalid credentials');
     }
 
-    const roleNames = user.roles.map(r => r.name);
+    const roleNames = user.roles.map(() => undefined);
     const token = jwt.sign({ sub: user.userID, roles: roleNames }, JWT_SECRET_KEY, { expiresIn: '7d' });
 
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Employee"
Received array: [null]

[Killed] ObjectLiteral
graphql/mutations/loginMutation.js:47:84
     }
 
     const roleNames = user.roles.map(r => r.name);
-    const token = jwt.sign({ sub: user.userID, roles: roleNames }, JWT_SECRET_KEY, { expiresIn: '7d' });
+    const token = jwt.sign({ sub: user.userID, roles: roleNames }, JWT_SECRET_KEY, {});
 
     return {
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ObjectLiteral
graphql/mutations/loginMutation.js:47:28
     }
 
     const roleNames = user.roles.map(r => r.name);
-    const token = jwt.sign({ sub: user.userID, roles: roleNames }, JWT_SECRET_KEY, { expiresIn: '7d' });
+    const token = jwt.sign({}, JWT_SECRET_KEY, { expiresIn: '7d' });
 
     return {
killedBy: users_loginMutation loginAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined
