[Killed] LogicalOperator
graphql/mutations/registerMutation.js:26:20
     input: { type: new GraphQLNonNull(RegisterInputType) },
   },
   async resolve(_, { input }) {
-    const email = (input.email || '').trim();
+    const email = (input.email && '').trim();
     const password = input.password || '';
     const username = (input.username || '').trim();
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Email is required]]

[Killed] LogicalOperator
graphql/mutations/registerMutation.js:27:22
   },
   async resolve(_, { input }) {
     const email = (input.email || '').trim();
-    const password = input.password || '';
+    const password = input.password && '';
     const username = (input.username || '').trim();
     const firstName = (input.firstName || '').trim();
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Password is required]]

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:28:23
   async resolve(_, { input }) {
     const email = (input.email || '').trim();
     const password = input.password || '';
-    const username = (input.username || '').trim();
+    const username = (false).trim();
     const firstName = (input.firstName || '').trim();
     const lastName = (input.lastName || '').trim();
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).trim is not a function]]

[Killed] MethodExpression
graphql/mutations/registerMutation.js:28:22
   async resolve(_, { input }) {
     const email = (input.email || '').trim();
     const password = input.password || '';
-    const username = (input.username || '').trim();
+    const username = input.username || '';
     const firstName = (input.firstName || '').trim();
     const lastName = (input.lastName || '').trim();
killedBy: users_registerMutation registerTrimsFields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "trimuser"
Received: "  trimuser  "

[Killed] LogicalOperator
graphql/mutations/registerMutation.js:29:24
     const email = (input.email || '').trim();
     const password = input.password || '';
     const username = (input.username || '').trim();
-    const firstName = (input.firstName || '').trim();
+    const firstName = (input.firstName && '').trim();
     const lastName = (input.lastName || '').trim();
 
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: First name is required]]

[Killed] MethodExpression
graphql/mutations/registerMutation.js:29:23
     const email = (input.email || '').trim();
     const password = input.password || '';
     const username = (input.username || '').trim();
-    const firstName = (input.firstName || '').trim();
+    const firstName = input.firstName || '';
     const lastName = (input.lastName || '').trim();
 
killedBy: users_registerMutation registerTrimsFields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Jenna"
Received: "  Jenna  "

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:30:23
     const password = input.password || '';
     const username = (input.username || '').trim();
     const firstName = (input.firstName || '').trim();
-    const lastName = (input.lastName || '').trim();
+    const lastName = (false).trim();
 
     if (!email) throw new Error('Email is required');
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).trim is not a function]]

[Killed] LogicalOperator
graphql/mutations/registerMutation.js:30:23
     const password = input.password || '';
     const username = (input.username || '').trim();
     const firstName = (input.firstName || '').trim();
-    const lastName = (input.lastName || '').trim();
+    const lastName = (input.lastName && '').trim();
 
     if (!email) throw new Error('Email is required');
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Last name is required]]

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:32:9
     const firstName = (input.firstName || '').trim();
     const lastName = (input.lastName || '').trim();
 
-    if (!email) throw new Error('Email is required');
+    if (false) throw new Error('Email is required');
     if (email.length < emailMinLength || email.length > emailMaxLength) {
       throw new Error('Email must be between 5 and 254 characters');
killedBy: users_registerMutation registerEmailMissing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Email is required"
Received: "Email must be between 5 and 254 characters"

[Killed] EqualityOperator
graphql/mutations/registerMutation.js:33:9
     const lastName = (input.lastName || '').trim();
 
     if (!email) throw new Error('Email is required');
-    if (email.length < emailMinLength || email.length > emailMaxLength) {
+    if (email.length >= emailMinLength || email.length > emailMaxLength) {
       throw new Error('Email must be between 5 and 254 characters');
     }
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Email must be between 5 and 254 characters]]

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:36:9
     if (email.length < emailMinLength || email.length > emailMaxLength) {
       throw new Error('Email must be between 5 and 254 characters');
     }
-    if (!emailRegex.test(email)) throw new Error('Email is invalid');
+    if (true) throw new Error('Email is invalid');
 
     if (!password) throw new Error('Password is required');
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Email is invalid]]

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:39:9
     if (!emailRegex.test(email)) throw new Error('Email is invalid');
 
     if (!password) throw new Error('Password is required');
-    if (password.length < passwordMinLength || password.length > passwordMaxLength) {
+    if (true) {
       throw new Error('Password must be between 8 and 64 characters');
     }
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Password must be between 8 and 64 characters]]

[Killed] StringLiteral
graphql/mutations/registerMutation.js:40:23
 
     if (!password) throw new Error('Password is required');
     if (password.length < passwordMinLength || password.length > passwordMaxLength) {
-      throw new Error('Password must be between 8 and 64 characters');
+      throw new Error("");
     }
 
killedBy: users_registerMutation registerPasswordTooShort
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Password must be between 8 and 64 characters"
Received: ""

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:43:9
       throw new Error('Password must be between 8 and 64 characters');
     }
 
-    if (!username) throw new Error('Username is required');
+    if (true) throw new Error('Username is required');
     if (username.length < usernameMinLength || username.length > usernameMaxLength) {
       throw new Error('Username must be between 3 and 30 characters');
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Username is required]]

[Killed] BooleanLiteral
graphql/mutations/registerMutation.js:43:9
       throw new Error('Password must be between 8 and 64 characters');
     }
 
-    if (!username) throw new Error('Username is required');
+    if (username) throw new Error('Username is required');
     if (username.length < usernameMinLength || username.length > usernameMaxLength) {
       throw new Error('Username must be between 3 and 30 characters');
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Username is required]]

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:44:9
     }
 
     if (!username) throw new Error('Username is required');
-    if (username.length < usernameMinLength || username.length > usernameMaxLength) {
+    if (true) {
       throw new Error('Username must be between 3 and 30 characters');
     }
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Username must be between 3 and 30 characters]]

[Killed] EqualityOperator
graphql/mutations/registerMutation.js:44:48
     }
 
     if (!username) throw new Error('Username is required');
-    if (username.length < usernameMinLength || username.length > usernameMaxLength) {
+    if (username.length < usernameMinLength || username.length <= usernameMaxLength) {
       throw new Error('Username must be between 3 and 30 characters');
     }
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Username must be between 3 and 30 characters]]

[Killed] BooleanLiteral
graphql/mutations/registerMutation.js:48:9
       throw new Error('Username must be between 3 and 30 characters');
     }
 
-    if (!firstName) throw new Error('First name is required');
+    if (firstName) throw new Error('First name is required');
     if (firstName.length < nameMinLength || firstName.length > nameMaxLength) {
       throw new Error('First name must be between 2 and 50 characters');
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: First name is required]]

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:48:9
       throw new Error('Username must be between 3 and 30 characters');
     }
 
-    if (!firstName) throw new Error('First name is required');
+    if (true) throw new Error('First name is required');
     if (firstName.length < nameMinLength || firstName.length > nameMaxLength) {
       throw new Error('First name must be between 2 and 50 characters');
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: First name is required]]

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:49:9
     }
 
     if (!firstName) throw new Error('First name is required');
-    if (firstName.length < nameMinLength || firstName.length > nameMaxLength) {
+    if (false) {
       throw new Error('First name must be between 2 and 50 characters');
     }
killedBy: users_registerMutation registerFirstNameTooShort
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:49:9
     }
 
     if (!firstName) throw new Error('First name is required');
-    if (firstName.length < nameMinLength || firstName.length > nameMaxLength) {
+    if (false || firstName.length > nameMaxLength) {
       throw new Error('First name must be between 2 and 50 characters');
     }
killedBy: users_registerMutation registerFirstNameTooShort
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:53:9
       throw new Error('First name must be between 2 and 50 characters');
     }
 
-    if (!lastName) throw new Error('Last name is required');
+    if (true) throw new Error('Last name is required');
     if (lastName.length < nameMinLength || lastName.length > nameMaxLength) {
       throw new Error('Last name must be between 2 and 50 characters');
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Last name is required]]

[Killed] BooleanLiteral
graphql/mutations/registerMutation.js:53:9
       throw new Error('First name must be between 2 and 50 characters');
     }
 
-    if (!lastName) throw new Error('Last name is required');
+    if (lastName) throw new Error('Last name is required');
     if (lastName.length < nameMinLength || lastName.length > nameMaxLength) {
       throw new Error('Last name must be between 2 and 50 characters');
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Last name is required]]

[Killed] EqualityOperator
graphql/mutations/registerMutation.js:54:9
     }
 
     if (!lastName) throw new Error('Last name is required');
-    if (lastName.length < nameMinLength || lastName.length > nameMaxLength) {
+    if (lastName.length <= nameMinLength || lastName.length > nameMaxLength) {
       throw new Error('Last name must be between 2 and 50 characters');
     }
killedBy: users_registerMutation registerLastNameMinLengthValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Last name must be between 2 and 50 characters]]

[Killed] EqualityOperator
graphql/mutations/registerMutation.js:54:44
     }
 
     if (!lastName) throw new Error('Last name is required');
-    if (lastName.length < nameMinLength || lastName.length > nameMaxLength) {
+    if (lastName.length < nameMinLength || lastName.length <= nameMaxLength) {
       throw new Error('Last name must be between 2 and 50 characters');
     }
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Last name must be between 2 and 50 characters]]

[Killed] ObjectLiteral
graphql/mutations/registerMutation.js:58:58
       throw new Error('Last name must be between 2 and 50 characters');
     }
 
-    const existingEmail = await db.User.findOne({ where: { email } });
+    const existingEmail = await db.User.findOne({ where: {} });
     if (existingEmail) {
       throw new Error('Email already in use');
killedBy: users_registerMutation registerAssignsEmployeeRoleWhenRoleExistsForOtherUser
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Email already in use]]

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:59:9
     }
 
     const existingEmail = await db.User.findOne({ where: { email } });
-    if (existingEmail) {
+    if (true) {
       throw new Error('Email already in use');
     }
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Email already in use]]

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:59:9
     }
 
     const existingEmail = await db.User.findOne({ where: { email } });
-    if (existingEmail) {
+    if (false) {
       throw new Error('Email already in use');
     }
killedBy: users_registerMutation registerEmailDuplicate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Email already in use"
Received: "Validation error"

[Killed] StringLiteral
graphql/mutations/registerMutation.js:60:23
 
     const existingEmail = await db.User.findOne({ where: { email } });
     if (existingEmail) {
-      throw new Error('Email already in use');
+      throw new Error("");
     }
 
killedBy: users_registerMutation registerEmailDuplicate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Email already in use"
Received: ""

[Killed] ObjectLiteral
graphql/mutations/registerMutation.js:63:52
       throw new Error('Email already in use');
     }
 
-    const existingUsername = await db.User.findOne({ where: { username } });
+    const existingUsername = await db.User.findOne({});
     if (existingUsername) {
       throw new Error('Username already in use');
killedBy: users_registerMutation registerAssignsEmployeeRoleWhenRoleExistsForOtherUser
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Username already in use]]

[Killed] BlockStatement
graphql/mutations/registerMutation.js:64:27
     }
 
     const existingUsername = await db.User.findOne({ where: { username } });
-    if (existingUsername) {
-      throw new Error('Username already in use');
-    }
+    if (existingUsername) {}
 
     const hashed = await bcrypt.hash(input.password, 10);
killedBy: users_registerMutation registerUsernameDuplicate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Username already in use"
Received: "Validation error"

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:64:9
     }
 
     const existingUsername = await db.User.findOne({ where: { username } });
-    if (existingUsername) {
+    if (false) {
       throw new Error('Username already in use');
     }
killedBy: users_registerMutation registerUsernameDuplicate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Username already in use"
Received: "Validation error"

[Killed] ObjectLiteral
graphql/mutations/registerMutation.js:70:39
 
     const hashed = await bcrypt.hash(input.password, 10);
 
-    const user = await db.User.create({
-      email,
-      password: hashed,
-      username,
-      firstName,
-      lastName,
-      // position and team are not settable during registration
-    });
+    const user = await db.User.create({});
 
     // assign Employee role if it exists
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: notNull Violation: User.email cannot be null,
notNull Violation: User.password cannot be null]]

[Killed] ObjectLiteral
graphql/mutations/registerMutation.js:80:48
     });
 
     // assign Employee role if it exists
-    const employeeRole = await db.Role.findOne({ where: { name: 'Employee' } });
+    const employeeRole = await db.Role.findOne({});
     if (employeeRole) {
       await db.UserRole.findOrCreate({
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Employee"
Received array: ["Admin"]

[Killed] ConditionalExpression
graphql/mutations/registerMutation.js:81:9
 
     // assign Employee role if it exists
     const employeeRole = await db.Role.findOne({ where: { name: 'Employee' } });
-    if (employeeRole) {
+    if (true) {
       await db.UserRole.findOrCreate({
         where: { userID: user.userID, roleID: employeeRole.roleID },
killedBy: users_registerMutation registerAllValidWithoutEmployeeRole
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Cannot read properties of null (reading 'roleID')]]

[Killed] BlockStatement
graphql/mutations/registerMutation.js:81:23
 
     // assign Employee role if it exists
     const employeeRole = await db.Role.findOne({ where: { name: 'Employee' } });
-    if (employeeRole) {
-      await db.UserRole.findOrCreate({
-        where: { userID: user.userID, roleID: employeeRole.roleID },
-      });
-    }
+    if (employeeRole) {}
 
     // reload user with roles for returning
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Employee"
Received array: []

[Killed] ObjectLiteral
graphql/mutations/registerMutation.js:83:16
     const employeeRole = await db.Role.findOne({ where: { name: 'Employee' } });
     if (employeeRole) {
       await db.UserRole.findOrCreate({
-        where: { userID: user.userID, roleID: employeeRole.roleID },
+        where: {},
       });
     }
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: notNull Violation: UserRole.userID cannot be null,
notNull Violation: UserRole.roleID cannot be null]]

[Killed] ObjectLiteral
graphql/mutations/registerMutation.js:88:75
     }
 
     // reload user with roles for returning
-    const userWithRoles = await db.User.findByPk(user.userID, { include: [{ model: db.Role, as: 'roles' }, { model: db.Team, as: 'team' }, { model: db.Position, as: 'position' }] });
+    const userWithRoles = await db.User.findByPk(user.userID, { include: [{}, { model: db.Team, as: 'team' }, { model: db.Position, as: 'position' }] });
     userWithRoles.__allowUnauthenticated = true;
 
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Include unexpected. Element has to be either a Model, an Association or an object.]]

[Killed] ObjectLiteral
graphql/mutations/registerMutation.js:88:108
     }
 
     // reload user with roles for returning
-    const userWithRoles = await db.User.findByPk(user.userID, { include: [{ model: db.Role, as: 'roles' }, { model: db.Team, as: 'team' }, { model: db.Position, as: 'position' }] });
+    const userWithRoles = await db.User.findByPk(user.userID, { include: [{ model: db.Role, as: 'roles' }, {}, { model: db.Position, as: 'position' }] });
     userWithRoles.__allowUnauthenticated = true;
 
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Include unexpected. Element has to be either a Model, an Association or an object.]]

[Killed] BooleanLiteral
graphql/mutations/registerMutation.js:89:44
 
     // reload user with roles for returning
     const userWithRoles = await db.User.findByPk(user.userID, { include: [{ model: db.Role, as: 'roles' }, { model: db.Team, as: 'team' }, { model: db.Position, as: 'position' }] });
-    userWithRoles.__allowUnauthenticated = true;
+    userWithRoles.__allowUnauthenticated = false;
 
     const roleNames = userWithRoles.roles.map(r => r.name);
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Not authenticated]]

[Killed] ArrowFunction
graphql/mutations/registerMutation.js:91:47
     const userWithRoles = await db.User.findByPk(user.userID, { include: [{ model: db.Role, as: 'roles' }, { model: db.Team, as: 'team' }, { model: db.Position, as: 'position' }] });
     userWithRoles.__allowUnauthenticated = true;
 
-    const roleNames = userWithRoles.roles.map(r => r.name);
+    const roleNames = userWithRoles.roles.map(() => undefined);
     const token = jwt.sign({ sub: user.userID, roles: roleNames }, JWT_SECRET_KEY, { expiresIn: '7d' });
 
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Employee"
Received array: [null]

[Killed] ObjectLiteral
graphql/mutations/registerMutation.js:94:12
     const roleNames = userWithRoles.roles.map(r => r.name);
     const token = jwt.sign({ sub: user.userID, roles: roleNames }, JWT_SECRET_KEY, { expiresIn: '7d' });
 
-    return {
-      token,
-      user: userWithRoles,
-    };
+    return {};
   },
 };
killedBy: users_registerMutation registerAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Cannot return null for non-nullable field AuthPayload.token.]]
