[Killed] BlockStatement
graphql/mutations/removeUserFromProjectMutation.js:11:51
   args: {
     input: { type: new GraphQLNonNull(RemoveUserFromProjectInputType) },
   },
-  resolve: async (_source, { input }, context) => {
-    const { projectID, userID } = input;
-    authorizeRoles(context, ['Admin', 'Manager']);
-
-    const deletedCount = await db.UserProject.destroy({
-      where: { projectID, userID }
-    });
-
-    if (deletedCount === 0) {
-      throw new Error('User was not assigned to this project or project/user not found');
-    }
-
-    return true;
-  },
+  resolve: async (_source, { input }, context) => {},
 };
killedBy: projects_removeUserFromProjectMutation removeUserFromProjectAllValid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: null

[Killed] ObjectLiteral
graphql/mutations/removeUserFromProjectMutation.js:15:55
     const { projectID, userID } = input;
     authorizeRoles(context, ['Admin', 'Manager']);
 
-    const deletedCount = await db.UserProject.destroy({
-      where: { projectID, userID }
-    });
+    const deletedCount = await db.UserProject.destroy({});
 
     if (deletedCount === 0) {
killedBy: projects_removeUserFromProjectMutation removeUserFromProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Missing where or truncate attribute in the options parameter of model.destroy.]]

[Killed] EqualityOperator
graphql/mutations/removeUserFromProjectMutation.js:19:9
       where: { projectID, userID }
     });
 
-    if (deletedCount === 0) {
+    if (deletedCount !== 0) {
       throw new Error('User was not assigned to this project or project/user not found');
     }
killedBy: projects_removeUserFromProjectMutation removeUserFromProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: User was not assigned to this project or project/user not found]]

[Killed] BlockStatement
graphql/mutations/removeUserFromProjectMutation.js:19:29
       where: { projectID, userID }
     });
 
-    if (deletedCount === 0) {
-      throw new Error('User was not assigned to this project or project/user not found');
-    }
+    if (deletedCount === 0) {}
 
     return true;
killedBy: projects_removeUserFromProjectMutation removeUserFromProjectLinkNotFound
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
graphql/mutations/removeUserFromProjectMutation.js:20:23
     });
 
     if (deletedCount === 0) {
-      throw new Error('User was not assigned to this project or project/user not found');
+      throw new Error("");
     }
 
killedBy: projects_removeUserFromProjectMutation removeUserFromProjectLinkNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User was not assigned to this project or project/user not found"
Received: ""
