[Killed] ConditionalExpression
graphql/mutations/updateProjectMutation.js:21:9
     authorizeRoles(context, ['Admin', 'Manager']);
 
     const project = await db.Project.findByPk(args.projectID);
-    if (!project) throw new Error('Project not found');
+    if (false) throw new Error('Project not found');
 
     if (typeof args.name === 'string') {
killedBy: projects_updateProjectMutation updateProjectNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Project not found"
Received: "Cannot read properties of null (reading 'update')"

[Killed] BooleanLiteral
graphql/mutations/updateProjectMutation.js:21:9
     authorizeRoles(context, ['Admin', 'Manager']);
 
     const project = await db.Project.findByPk(args.projectID);
-    if (!project) throw new Error('Project not found');
+    if (project) throw new Error('Project not found');
 
     if (typeof args.name === 'string') {
killedBy: projects_updateProjectMutation updateProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project not found]]

[Killed] BlockStatement
graphql/mutations/updateProjectMutation.js:23:40
     const project = await db.Project.findByPk(args.projectID);
     if (!project) throw new Error('Project not found');
 
-    if (typeof args.name === 'string') {
-      const trimmedName = args.name.trim();
-      if (!trimmedName) throw new Error('Project name is required');
-      if (trimmedName.length < projectNameMinLength || trimmedName.length > projectNameMaxLength) {
-        throw new Error('Project name must be between 3 and 50 characters');
-      }
-      args.name = trimmedName;
-    }
+    if (typeof args.name === 'string') {}
 
     if (typeof args.description === 'string') {
killedBy: projects_updateProjectMutation updateProjectNameMissing
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/updateProjectMutation.js:23:9
     const project = await db.Project.findByPk(args.projectID);
     if (!project) throw new Error('Project not found');
 
-    if (typeof args.name === 'string') {
+    if (false) {
       const trimmedName = args.name.trim();
       if (!trimmedName) throw new Error('Project name is required');
killedBy: projects_updateProjectMutation updateProjectNameMissing
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] MethodExpression
graphql/mutations/updateProjectMutation.js:24:27
     if (!project) throw new Error('Project not found');
 
     if (typeof args.name === 'string') {
-      const trimmedName = args.name.trim();
+      const trimmedName = args.name;
       if (!trimmedName) throw new Error('Project name is required');
       if (trimmedName.length < projectNameMinLength || trimmedName.length > projectNameMaxLength) {
killedBy: projects_updateProjectMutation updateProjectTrimsName
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NewName"
Received: "  NewName  "

[Killed] ConditionalExpression
graphql/mutations/updateProjectMutation.js:25:11
 
     if (typeof args.name === 'string') {
       const trimmedName = args.name.trim();
-      if (!trimmedName) throw new Error('Project name is required');
+      if (false) throw new Error('Project name is required');
       if (trimmedName.length < projectNameMinLength || trimmedName.length > projectNameMaxLength) {
         throw new Error('Project name must be between 3 and 50 characters');
killedBy: projects_updateProjectMutation updateProjectNameMissing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Project name is required"
Received: "Project name must be between 3 and 50 characters"

[Killed] BooleanLiteral
graphql/mutations/updateProjectMutation.js:25:11
 
     if (typeof args.name === 'string') {
       const trimmedName = args.name.trim();
-      if (!trimmedName) throw new Error('Project name is required');
+      if (trimmedName) throw new Error('Project name is required');
       if (trimmedName.length < projectNameMinLength || trimmedName.length > projectNameMaxLength) {
         throw new Error('Project name must be between 3 and 50 characters');
killedBy: projects_updateProjectMutation updateProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project name is required]]

[Killed] ConditionalExpression
graphql/mutations/updateProjectMutation.js:26:11
     if (typeof args.name === 'string') {
       const trimmedName = args.name.trim();
       if (!trimmedName) throw new Error('Project name is required');
-      if (trimmedName.length < projectNameMinLength || trimmedName.length > projectNameMaxLength) {
+      if (true) {
         throw new Error('Project name must be between 3 and 50 characters');
       }
killedBy: projects_updateProjectMutation updateProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Project name must be between 3 and 50 characters]]

[Killed] LogicalOperator
graphql/mutations/updateProjectMutation.js:26:11
     if (typeof args.name === 'string') {
       const trimmedName = args.name.trim();
       if (!trimmedName) throw new Error('Project name is required');
-      if (trimmedName.length < projectNameMinLength || trimmedName.length > projectNameMaxLength) {
+      if (trimmedName.length < projectNameMinLength && trimmedName.length > projectNameMaxLength) {
         throw new Error('Project name must be between 3 and 50 characters');
       }
killedBy: projects_updateProjectMutation updateProjectNameTooShort
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
graphql/mutations/updateProjectMutation.js:32:47
       args.name = trimmedName;
     }
 
-    if (typeof args.description === 'string') {
-      const trimmedDescription = args.description.trim();
-      if (trimmedDescription && trimmedDescription.length > descriptionMaxLength) {
-        throw new Error('Description must be at most 500 characters');
-      }
-      args.description = trimmedDescription;
-    }
+    if (typeof args.description === 'string') {}
 
     if (args.repositoryID) {
killedBy: projects_updateProjectMutation updateProjectDescriptionTooLong
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/updateProjectMutation.js:32:9
       args.name = trimmedName;
     }
 
-    if (typeof args.description === 'string') {
+    if (true) {
       const trimmedDescription = args.description.trim();
       if (trimmedDescription && trimmedDescription.length > descriptionMaxLength) {
killedBy: projects_updateProjectMutation updateProjectRepositoryValidOnly
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Cannot read properties of undefined (reading 'trim')]]

[Killed] MethodExpression
graphql/mutations/updateProjectMutation.js:33:34
     }
 
     if (typeof args.description === 'string') {
-      const trimmedDescription = args.description.trim();
+      const trimmedDescription = args.description;
       if (trimmedDescription && trimmedDescription.length > descriptionMaxLength) {
         throw new Error('Description must be at most 500 characters');
killedBy: projects_updateProjectMutation updateProjectTrimsDescription
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Updated description"
Received: "  Updated description  "

[Killed] ConditionalExpression
graphql/mutations/updateProjectMutation.js:34:11
 
     if (typeof args.description === 'string') {
       const trimmedDescription = args.description.trim();
-      if (trimmedDescription && trimmedDescription.length > descriptionMaxLength) {
+      if (false) {
         throw new Error('Description must be at most 500 characters');
       }
killedBy: projects_updateProjectMutation updateProjectDescriptionTooLong
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
graphql/mutations/updateProjectMutation.js:34:83
 
     if (typeof args.description === 'string') {
       const trimmedDescription = args.description.trim();
-      if (trimmedDescription && trimmedDescription.length > descriptionMaxLength) {
-        throw new Error('Description must be at most 500 characters');
-      }
+      if (trimmedDescription && trimmedDescription.length > descriptionMaxLength) {}
       args.description = trimmedDescription;
     }
killedBy: projects_updateProjectMutation updateProjectDescriptionTooLong
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
graphql/mutations/updateProjectMutation.js:40:9
       args.description = trimmedDescription;
     }
 
-    if (args.repositoryID) {
+    if (false) {
         const repo = await db.Repository.findByPk(args.repositoryID);
         if (!repo) throw new Error('Repository ID not found');
killedBy: projects_updateProjectMutation updateProjectRepositoryNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Repository ID not found"
Received: "SQLITE_CONSTRAINT: FOREIGN KEY constraint failed"

[Killed] ConditionalExpression
graphql/mutations/updateProjectMutation.js:40:9
       args.description = trimmedDescription;
     }
 
-    if (args.repositoryID) {
+    if (true) {
         const repo = await db.Repository.findByPk(args.repositoryID);
         if (!repo) throw new Error('Repository ID not found');
killedBy: projects_updateProjectMutation updateProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Repository ID not found]]

[Killed] ConditionalExpression
graphql/mutations/updateProjectMutation.js:42:13
 
     if (args.repositoryID) {
         const repo = await db.Repository.findByPk(args.repositoryID);
-        if (!repo) throw new Error('Repository ID not found');
+        if (false) throw new Error('Repository ID not found');
     }
 
killedBy: projects_updateProjectMutation updateProjectRepositoryNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Repository ID not found"
Received: "SQLITE_CONSTRAINT: FOREIGN KEY constraint failed"

[Killed] BooleanLiteral
graphql/mutations/updateProjectMutation.js:42:13
 
     if (args.repositoryID) {
         const repo = await db.Repository.findByPk(args.repositoryID);
-        if (!repo) throw new Error('Repository ID not found');
+        if (repo) throw new Error('Repository ID not found');
     }
 
killedBy: projects_updateProjectMutation updateProjectRepositoryNotFound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Repository ID not found"
Received: "SQLITE_CONSTRAINT: FOREIGN KEY constraint failed"

[Killed] StringLiteral
graphql/mutations/updateProjectMutation.js:48:47
     await project.update(args);
 
     return db.Project.findByPk(project.projectID, {
-        include: [{ model: db.Repository, as: 'repository' }]
+        include: [{ model: db.Repository, as: "" }]
     });
   },
killedBy: projects_updateProjectMutation updateProjectAllValid
statusReason: Error: expect(received).toBeUndefined()

Received: [[GraphQLError: Repository is associated to Project using an alias. You must use the 'as' keyword to specify the alias within your include statement.]]
